[
    {
        "content": "<p>I’m about to buy a tablet to run OpenCPN.  That creates a choice between an Android tablet and a Windows tablet. Any advice on which runs OpenCPN and its plugins more reliably? All other things being equal I’d favor Android, but not if OpenCPN on Android is less reliable/usable than on Windows. Any advice much appreciated.</p>",
        "id": 570377318,
        "sender_full_name": "Quinton Hoole",
        "timestamp": 1769534000
    },
    {
        "content": "<p>I purchased a Sailproof tablet last summer. I see no major problems and the hardware is really nice, good enough to use outdoors</p>",
        "id": 570418252,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1769546471
    },
    {
        "content": "<p><a href=\"https://sailproof.shop/\">https://sailproof.shop/</a></p>",
        "id": 570418422,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1769546535
    },
    {
        "content": "<p>Thanks! You’re the second person who’s recommended the Sailproof. <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 570418434,
        "sender_full_name": "Quinton Hoole",
        "timestamp": 1769546540
    },
    {
        "content": "<p>By the way, I just tried  accessing OpenCPN remotely using VNC over WiFi  from my iPad and it really doesn’t work very well (somewhat unsurprisingly). It’s very laggy, and the UI very clunky to use (partly due to the lag). Just in case anyone’s considering that as an alternative.</p>",
        "id": 570418897,
        "sender_full_name": "Quinton Hoole",
        "timestamp": 1769546720
    },
    {
        "content": "<p>IIRC rdp works better than vnc</p>",
        "id": 570419240,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1769546857
    },
    {
        "content": "<p>Thanks, I’ll try them all, just for the record.</p>\n<p>But I would expect none of them to work very well with accelerated graphics like satellite images using OpenGL, which is a very common use case (getting good satellite images to the helm). I think most of the Remote Desktop protocols are probably optimized for traditional applications displaying text, widgets and vectors.</p>",
        "id": 570420262,
        "sender_full_name": "Quinton Hoole",
        "timestamp": 1769547244
    },
    {
        "content": "<p>Using a cable it's fine running against my  Orange Pi 5, networked it's barely usable</p>",
        "id": 570420941,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1769547462
    },
    {
        "content": "<p>... and I dont use satellite images.</p>",
        "id": 570421243,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1769547538
    },
    {
        "content": "<p>what kind of cable are you referring to?</p>",
        "id": 570421474,
        "sender_full_name": "Quinton Hoole",
        "timestamp": 1769547606
    },
    {
        "content": "<p>Also, now that ive figured out how the UI works over vnc, its not as terrible as it was initially.</p>",
        "id": 570421681,
        "sender_full_name": "Quinton Hoole",
        "timestamp": 1769547665
    },
    {
        "content": "<p>The trick is to setup something, I  have an RPi,  which is connected  to the sensors and then feeds the tablet with NMEA data over UDP. This works  great, the display is local. You just need to replicate routes and such.</p>",
        "id": 570421784,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1769547695
    },
    {
        "content": "<p>cable: Forget it, it's when using a laptop</p>",
        "id": 570422056,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1769547772
    }
]