[
    {
        "content": "<p>Previously, I have been able to debug under Xcode by</p>\n<ul>\n<li>In ci/circleci-build-macos.sh setting build type to debug and building</li>\n<li>Launching Xcode and running OpenCPN</li>\n<li>Adding source files to Xcode</li>\n<li>Setting breakpoints as required.</li>\n</ul>\n<p>Now the breakpoints will not stick - they have a dotted outline.  This is likely because the debug tables are missing.<br>\nThis problem seems to have arisen since the build was modified to support Apple silicon.</p>\n<p>I am running on an M2 Mac.</p>\n<p>Relevant setting is:</p>\n<div class=\"codehilite\"><pre><span></span><code>cmake \\\n  -DCMAKE_BUILD_TYPE=${CMAKE_BUILD_TYPE:-Debug} \\\n  -DCMAKE_INSTALL_PREFIX= \\\n  -DCMAKE_OSX_DEPLOYMENT_TARGET=${MACOSX_DEPLOYMENT_TARGET} \\\n  -DOCPN_TARGET_TUPLE=&quot;darwin-wx32;10;universal&quot; \\\n  -DCMAKE_OSX_ARCHITECTURES=&quot;arm64;x86_64&quot; \\\n  ..\n</code></pre></div>\n<p>The above has changed since I had Xcode working OK to accommodate Apple Silicon</p>\n<p>I assume on my M2 Mac, I building for arm.<br>\nHowever, In order to get Xcode to run OCPN I have to set set the Product Destination to <code>My Mac (Rosetta)'.  If I choose </code>Apple Silicon<code> or </code>Show both<code>  when I launch OCPN, I get </code>Cannot launch using specified run destination`</p>\n<p>I am running with OCPN v5.8.4-0-1637c28</p>\n<p>Anyone got this working?</p>",
        "id": 416968682,
        "sender_full_name": "Tony Voss",
        "timestamp": 1705737615
    },
    {
        "content": "<p>You are building the Universal binary if you use the above, but at the same time not against our dependencies bundle, that is usually not a good idea and takes twice as long to build if nothing else.<br>\nYou already have all the dependencies available, so I suppose the CI build script does next to nothing useful for you.<br>\nI simply go to my build folder and do <code>cmake -GXcode .. ; open OpenCPN.xcodeproj</code> when I want to use Xcode.</p>",
        "id": 416994468,
        "sender_full_name": "Pavel Kalian",
        "timestamp": 1705760200
    },
    {
        "content": "<p>Only now got back to this.  Breakpoints revert to dotted surround.  This is usually because the debug tables are not present.<br>\nHave I got the -Debug bit in the cmake file correct?  (It has changed from when I last had this working.)</p>",
        "id": 420422742,
        "sender_full_name": "Tony Voss",
        "timestamp": 1707386415
    },
    {
        "content": "<p>We are trying to do different things.  I am only trying to debug a plugin - not OCPN. How it used to work:</p>\n<ol>\n<li>Build plugin tarball with debug set</li>\n<li>Import plugin into OCPN</li>\n<li>Launch standard OCPN from Xcode or attach OCPN process</li>\n<li>Set breakpoint in plugin code</li>\n<li>Hit breakpoint and start tracing<br>\nI could even edit plugin code, rebuild tarball and import without quitting OCPN and get to a breakpoint again.<br>\nAny ideas how to do the equivalent now, please?</li>\n</ol>",
        "id": 420426498,
        "sender_full_name": "Tony Voss",
        "timestamp": 1707387748
    },
    {
        "content": "<p>As far as I can tell this works for me just fine. I will try to record my exact workflow the next time I do some development on the Mac...</p>",
        "id": 420474993,
        "sender_full_name": "Pavel Kalian",
        "timestamp": 1707404141
    }
]