[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"517002\">@Dave Register</span> you asked me via email whether I could look at the NMEA 2000 AutoPilot integration. What do I need to test this in terms of hardware and what should it be doing? Send a waypoint and XTE -- like a NMEA 0183 connection?</p>",
        "id": 340230605,
        "sender_full_name": "Kees Verruijt",
        "timestamp": 1678229771
    },
    {
        "content": "<p>Kees...<br>\nWith this API, a plugin should be able to send arbitrary PGNs to the N2K bus.  Theoretically, then, we can build a plugin that emulates a commercial N2K autopilot.  Or there may be other ways to interface with N2K autopilots.<br>\nI think there is/was some discussion of a Raymarine Autopilot interface of some sort, but I lost the thread on that.  IIRC,  a plugin would synthesize the proper PGNs to allow the autopilot to follow a route created on OCPN.  And the PGNs are proprietary, so some RE required.<br>\nAm I on the right track?  If so, we can start a separate discussion about this.<br>\n<strong>The key point is this</strong>:  We do not necessarily need a Raymarine A/P plugin now.  But we do need to validate/prove that the API in O571 is functional and complete enough to build such a plugin, before we release O58x.  So some \"proof of concept\" work would be very useful assurance of that capability.</p>",
        "id": 340249065,
        "sender_full_name": "Dave Register",
        "timestamp": 1678239362
    },
    {
        "content": "<p>Ah okay, that makes sense.</p>",
        "id": 340286383,
        "sender_full_name": "Kees Verruijt",
        "timestamp": 1678261134
    },
    {
        "content": "<p>Dave, I've now tested the write-to-NMEA2000 API for plugins, and I can confirm that it works fine! I can send normal and proprietary PGNs just fine. Tested on Debian 11 + macOS.  <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>\n<p>I'm impressed with the level of detail in the NMEA2000 connection wizard on Linux, that even generates udev rules! I did have a fluke where the wx GUI elements were placed weirdly on Linux, but it is fine on macOS so it may be a wx issue. Leaving the settings windows and coming back it was fine, so it was no big deal. <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span> </p>\n<p>PS I did not test receiving NMEA2000 PGNs. Has someone else tested that or shall I do that?</p>",
        "id": 347653947,
        "sender_full_name": "Kees Verruijt",
        "timestamp": 1680871073
    },
    {
        "content": "<p>BTW I tested with an Actisense NGT-1.</p>",
        "id": 347657085,
        "sender_full_name": "Kees Verruijt",
        "timestamp": 1680871862
    }
]