[
    {
        "content": "<p>I have completed the Transpac 2025 using OpenCPN as one of the navigation systems aboard our Beneteau First 40. It was an absolute blast with lots of challenges and great memories, sailing from California to Hawaii in demanding offshore conditions. I'll provide detailed feedback on real-world offshore usage of OpenCPN, from a practical racing perspective.</p>\n<h2>Context and Competition</h2>\n<p>The professional and semi-professional boats were predominantly using commercial navigation software (Adrena and Expedition). Some of the skippers and navigators are world-class professionals with extensive offshore racing experience, with most crew members having highly specialized roles. We were not in that category, but we had tremendous fun nonetheless and proved that OpenCPN can be used effectively for offshore racing. </p>\n<h2>Overall Assessment</h2>\n<p>The combination of weather analysis, performance monitoring, and traditional navigation created a robust offshore sailing platform. OpenCPN worked well with few problems throughout most of the race, seamlessly integrating with our B&amp;G electronics and providing great navigation capabilities. The system performed well until laptop hardware failed due to seawater ingress during heavy weather - a scenario that highlighted both OpenCPN's strengths and areas for improvement.</p>\n<p>During this real-world offshore race, I have identified specific enhancements that would significantly improve reliability and usability, particularly for offshore racing applications. The feedback comes from actual usage in challenging conditions with multiple crew members of varying technical expertise.</p>",
        "id": 530213133,
        "sender_full_name": "Sebastien Rosset",
        "timestamp": 1753214206
    },
    {
        "content": "<h2>System Configuration</h2>\n<ul>\n<li><strong>Vessel</strong>: Beneteau First 40</li>\n<li><strong>Primary Setup</strong>: Ubuntu laptop with OpenCPN timeline branch + comprehensive plugin suite</li>\n<li><strong>Backup Setup</strong>: Windows laptop with OpenCPN 5.11.3 (post-failure recovery)</li>\n<li><strong>Connectivity</strong>: Starlink for GRIB downloads and data sync</li>\n<li><strong>Hardware Integration</strong>:<ul>\n<li>B&amp;G Zeus 3S chart plotter</li>\n<li>B&amp;G Triton deck displays</li>\n<li>Yacht Devices YDNU-02 USB NMEA gateway</li>\n<li>OpenCPN as navigation computer feeding B&amp;G system</li>\n<li>Ocean Signal MOB-1 devices configured in crew PFDs. Configure Ocean Signal MOB-1 MMSI numbers with crew names in Ships → MMSI Properties for crew safety identification</li>\n</ul>\n</li>\n<li><strong>Route</strong>: Standard Transpac course (California to Hawaii)</li>\n</ul>\n<h3>Plugin Configuration</h3>\n<ul>\n<li><strong>VDR</strong>: Continuous voyage data recording</li>\n<li><strong>Weather Routing</strong>: Primary routing calculations</li>\n<li><strong>WMM</strong>: Magnetic variation calculations</li>\n<li><strong>Dashboard</strong>: Polar performance monitoring and vessel parameters</li>\n<li><strong>Weather Fax</strong>: Weather system analysis and forecasting</li>\n<li><strong>OCPN Draw</strong>: Weather route what-if scenarios and exclusion zones for weather routing (e.g. south or north)</li>\n<li><strong>Tactics</strong>: Layline calculations and tactical sailing data</li>\n<li><strong>Celestial Navigation</strong>: Sextant-based position verification</li>\n<li><strong>Plots</strong>: Performance analysis and data visualization</li>\n</ul>",
        "id": 530216495,
        "sender_full_name": "Sebastien Rosset",
        "timestamp": 1753215584
    },
    {
        "content": "<h2>Weather Routing Process</h2>\n<p>We used the following process multiple times per day:</p>\n<ol>\n<li>Download GRIBs via Starlink</li>\n<li>Analyze weather data in OpenCPN and Weather Fax plugin</li>\n<li>Optionally create exclusion zones using OCPN Draw for zone avoidance</li>\n<li>Create multiple weather routing scenarios using weather routing plugin with tactical considerations</li>\n<li>Save multiple routes for comparison and analysis</li>\n<li>Use timeline widget to visualize weather evolution and route performance over time</li>\n<li>Manual route editing and optimization based on timeline analysis</li>\n<li>Route activation with manual waypoint selection</li>\n<li>Monitor performance via Dashboard plugin (polar data)</li>\n<li>Use Tactics plugin for real-time layline calculations</li>\n<li>Configure navigation data output (XTE, DTW, bearing) via YDNU-02 gateway</li>\n<li>B&amp;G Zeus 3S and Triton displays receive OpenCPN navigation data as primary source</li>\n<li>Crew uses navigation data on Triton display and verbal guidelines from the navigator.</li>\n</ol>",
        "id": 530217723,
        "sender_full_name": "Sebastien Rosset",
        "timestamp": 1753216160
    }
]