[
    {
        "content": "<p>It seems that the state of the plugins manual is broken. I'm on it, time permitting, will perhaps take some time</p>",
        "id": 316426242,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1671270922
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"573239\">@Pavel Kalian</span>  <span class=\"user-mention\" data-user-id=\"399559\">@Mike Rossiter</span>  ^</p>",
        "id": 316426312,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1671270958
    },
    {
        "content": "<p>Fixed. It was about updating site.yml in opencpn-manuals/main rather than in opencpn-manuals/plugins since we these days do all the builds from main.</p>",
        "id": 316442678,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1671277712
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"522486\">@Håkan Svensson</span>  I have updated the Windows build instructions at  <a href=\"https://opencpn-manuals.github.io/main/ocpn-dev-manual/0.1/od-compile-windows.html\">https://opencpn-manuals.github.io/main/ocpn-dev-manual/0.1/od-compile-windows.html</a>. Could you possibly review and fix mistakes by a not-that-windows-qualified /me? In particular, there is a FIXME whcih needs to be  sorted out.</p>\n<p>If you don't have commit permissions I'll give ASAP after writing this.</p>",
        "id": 317408425,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1671727840
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"522729\">@Dan Dickey</span>  The build instructions at <a href=\"https://opencpn-manuals.github.io/main/ocpn-dev-manual/0.1/od-compile-windows.html#_prerequisities\">https://opencpn-manuals.github.io/main/ocpn-dev-manual/0.1/od-compile-windows.html#_prerequisities</a> and so on needs an update for VS 2022 and wxWidgets 3.2. Could as the original author do this?</p>\n<p>I'll give write permissions ASAP after writing this.</p>",
        "id": 317409152,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1671728045
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"399510\">@Alec Leamas</span> <br>\nThanks for your efforts on this. Your knowledge is outstanding.<br>\nI have comments but is not able to elaborate it much for the moment. To many visiting grandchild around.<br>\nSome short.<br>\n-The instructions seems meant for a one time package builder from the command promt only? Not for developers working in VS2022. VS will not find wxWidgets since it's normally not started from the command promt. VS may need environment variables rather than command window temporary variables. </p>\n<ul>\n<li>If wx-config.bat is used wx will not be found. It's, by a bug?, set to \"\\buildwin\\..\\cache\\wxWidgets-3.2.\" </li>\n<li>More from win_deps.bat: Why store 7z in \\Buildwin? <br>\nAs said: To be continued when the house is calmer again. :)</li>\n</ul>",
        "id": 317506296,
        "sender_full_name": "Håkan Svensson",
        "timestamp": 1671780652
    },
    {
        "content": "<p>Thanks for compliments. This would not work without you, your are making some really good work here!</p>\n<p>Yes, this is focused on getting a  build on the command line to work. Since this is what we do in the CI jobs, it is what what we continously test and thus can trust. I'm aware of  missing instructions how to use this in VS, but I don't use that myself, so. Still, having this piece should be a good start.</p>\n<p>The storing 7z temporaries in buildwin\\ is a bug, not really realted to this. Will eventually fix.</p>\n<p>You can edit the page directly using the \"Edit This Page\"  bottom top-right. Please do! This includes adding a chapter how to set up the VS environment.</p>\n<p>Christmas also here, we don't expect things to move that fast for a while ;)</p>",
        "id": 317513559,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1671784237
    }
]