[
    {
        "content": "<p><strong>Public</strong> channel created by <span class=\"user-mention silent\" data-user-id=\"517002\">Dave Register</span>. <strong>Description:</strong></p>\n<blockquote>\n<p><em>No description.</em></p>\n</blockquote>",
        "id": 568835689,
        "sender_full_name": "Notification Bot",
        "timestamp": 1768838766
    },
    {
        "content": "<p>Dave Register: Hello all active devs.<br>\nThis channel will be used to describe and discuss the Release Plan for OpenCPN Version 5.14.x.<br>\nThis is the \"official\" plan, and all modifications and notifications will be made here.<br>\n<strong>Basic Plan Outline.</strong></p>\n<p>Feature Freeze: 1 Feb, 2026</p>\n<p>Beta Test starts: 9 Feb, 2026</p>\n<p>Target Release Date: 1 March, 2026</p>\n<p>Dave Register: About \"Feature Freeze\"</p>\n<ol>\n<li>As the name implies, at this point in the plan all proposed new Features should be scoped and actively under development.</li>\n<li>Feature development completion should target the Beta test start date.</li>\n<li>Slippage is expected for some recent Feature additions. It may occur that the target scope of the Feature must be reduced to meet the schedule.</li>\n<li>New Features that are not fully complete should try hard to not de-stabilize the core functionality at Beta test start.</li>\n</ol>",
        "id": 568836118,
        "sender_full_name": "Dave Register",
        "timestamp": 1768838899
    },
    {
        "content": "<p>I'd like to generate a list of new Features that contributors are working on.<br>\nPlease describe any such Features, and give us some sense of the progress made, and an idea of how this matches the proposed release schedule.</p>\n<p>I would also like comments on the various RFE's found in the github issues list.  Critical, fairly important, nice to have, etc.<br>\nFor reference, at this Release, I consider the release schedule more important than any particular RFE, but I will entertain discussion.</p>\n<p>I'll start:</p>\n<ol>\n<li>Refactor chart database rebuild process, to include a threaded model for improved performance.  Status:  Functionally complete, in current master branch, testing ongoing.  Plan: Include in O514.</li>\n</ol>\n<p>Thanks</p>",
        "id": 568840457,
        "sender_full_name": "Dave Register",
        "timestamp": 1768840232
    },
    {
        "content": "<p>I have nothing in the pipe myself. Back later on other stuff</p>",
        "id": 568965719,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1768897976
    }
]