[
    {
        "content": "<p>What should we do with this page which is left over from all the editing and  currently it is under Manage Routes.<br>\nIs it useful? Can it be edited down and added to some page?<br>\nIt really is kind of an orphan at this point, but it might be helpful in terms of understanding how to handle routes in a general way.  Someone needs to dig into this.  Should it be Edited down or removed?<br>\nOr should we just punt it and move it into Advanced Manual?</p>\n<p><a href=\"https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:route_manager:route_handling\">https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:route_manager:route_handling</a></p>",
        "id": 440719967,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1716736496
    },
    {
        "content": "<p>I've reviewed the page, it is good,  and merged it with \"Use Routes\"  one more page done. Thanks.</p>",
        "id": 440905516,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1716836463
    },
    {
        "content": "<p>Statuts &amp; Progress shows that Use Routes needs some integration of material. I took a look at this page and  the text uses route names like:<br>\n\"The first route is named “Route Name_ckgedit_QUOT<em>A</em>,\" <br>\nwhile the screenshot shows the route name as<br>\n\"Split_Route_Demo_A\". <br>\nI think the text should match the screenshots. Does anyone disagree?</p>",
        "id": 442091848,
        "sender_full_name": "Terry Slattery",
        "timestamp": 1717355850
    },
    {
        "content": "<p>No, we don't disagree. That must be someones typo or some error.</p>",
        "id": 442109949,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1717365262
    },
    {
        "content": "<p>I've looked this page over and found that one section that I moved from Route Properties earlier, actually belongs back on that page because it describes the ending line at the bottom.  I have moved it back, including how to split a route using the button at the bottom.</p>",
        "id": 442116203,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1717369761
    },
    {
        "content": "<p>I've fixed the route names and a few other minor things, like \"wpt\" to \"waypoint\". There are still some FIXMEs where screenshots are desired.</p>",
        "id": 442128791,
        "sender_full_name": "Terry Slattery",
        "timestamp": 1717378659
    }
]