[
    {
        "content": "<p>I was hoping to provide this screenshot, but I am struggling to get Opencpn installed on my Pi. </p>\n<p>However would Opencpn on the PI not look (almost) the same as shown under \"For Linux\"? In that case we maybe can do the same as was done for flatpack and refer to the Linux screenshots</p>",
        "id": 442901424,
        "sender_full_name": "Ties Brants",
        "timestamp": 1717623544
    },
    {
        "content": "<p>It is exactly the same thing. The Linux screenshot is actually from an Orange pi 5, an SBC very similar to Tpi 5.</p>\n<p>This is a general observation. There is no \"Rpi\"  use case in any scenario besides boot/install. The actual use case is Debian for most users on Rpi i. e., those using Raspbian. </p>\n<p>But in the end, the Rpi supports all kinds of distros like vanilla Debian, Arch, Ubuntu, Fedora and what not. What we support is the same as for PC platforms:</p>\n<ol>\n<li>\n<p>Native Debian,deb packages to be used on Debian and derivatives like Raspbian and LTS Ubuntu release.</p>\n</li>\n<li>\n<p>Flatpak to be used on other Linux distros.</p>\n</li>\n</ol>\n<p>Note that there basically are no such things as \"Linux' or \"Rpi\" here. It's either Debian or Flatpak. . Full stop.</p>",
        "id": 442962832,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1717647710
    },
    {
        "content": "<p>Sorry for long post. Short message: There is no need to document any Rpi GNSS installation use case, just Debian. Flatpak is actually identical.</p>",
        "id": 442965326,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1717649180
    },
    {
        "content": "<p>Thanks Alec. I changed the text for Raspberry Pi to be the same as for Flatpack (Raspberry Pi works almost the same way as Linux.). But based on what you are saying we might want to change both the Pi and the Pi text to indicate that it is not almost the same as Linux, but simple the same, do you agree?</p>\n<p>Also updated the 2024 status &amp; progress page. Removed the \"fix me' there.</p>",
        "id": 443078366,
        "sender_full_name": "Ties Brants",
        "timestamp": 1717685277
    },
    {
        "content": "<p>Thanks Alec</p>",
        "id": 443178054,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1717714979
    },
    {
        "content": "<blockquote>\n<p>But based on what you are saying we might want to change both the Pi and the Pi text to indicate that it is not almost the same as Linux, but simple the same, do you agree?</p>\n</blockquote>\n<p>Yes and no. </p>\n<p>Again: There is no such thing as Raspberry Pi in this context. There should be no such heading, it's irrelevant.</p>\n<p>Also: there is no such thing as Linux. We support Flatpak (note the spelling) and Debian. The latter includes derivatives like  Raspbian and Ubuntu LTS releases.</p>\n<p>Everything is about the operating system. Most RPI users uses Raspbian. Raspbian is a Debian derivative and is covered by the Debian documentation. Same goes for users using Ubuntu  LTS on RPi.</p>\n<p>Users utilizing other operating systems on the RPi uses Flatpak and is covered by the Flatpak documentation.</p>\n<p>Full stop.</p>",
        "id": 443234522,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1717746884
    },
    {
        "content": "<p>... it could be added that the differences between Flatpak and native Debian are really small, but do exist when looking at  the hairy detaills installling USB hardware. However, from a more practical standpoint they could be ignored, they are hidden by simple GUI dialogs.</p>",
        "id": 443235537,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1717747255
    },
    {
        "content": "<p><a href=\"https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:quick_start_guide:connect_to:global_navigation_satellite_system\">https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:quick_start_guide:connect_to:global_navigation_satellite_system</a></p>\n<p>This looks much clearer than when we started!  Looks good to me.</p>",
        "id": 443254108,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1717752878
    },
    {
        "content": "<p>Indeed. However, this is messed up:</p>\n<blockquote>\n<p>For Flatpak</p>\n</blockquote>\n<blockquote>\n<p>Flatpak works almost the same way as Linux.<br>\nFor Raspberry Pi<br>\nRaspbery Pi works almost the same way as Linux.</p>\n</blockquote>\n<p>Saying <em>Flatpak works almost the same way as Linux</em> is an oxymoron.  Using the word \"Linux\" here is what creates this mess. The correct would be <em>Flatpak works  more or lesss the same way as native Debian packages</em> </p>\n<p>Again: there is no such thing as \"Linux\" in this context.</p>\n<p>Saying <em>Raspbery Pi works almost the same way as Linux.</em> is another oxymoron. Raspberry PI (RPi) could be using either Debian packages or Flatpak depending on the actual operating system. So this sentence is plain wrong</p>\n<p>The best  solution would probably be to just drop the Raspberry Pi heading. Users on Raspbian should refer to the Debian use case, but this is not only about installing GNSS but an overall statement probably best placed somewhere else. Likewise, users on Flatpak should use the Flatpak docs. Whether is on a PC or an RPi is irrelevant.</p>",
        "id": 443281451,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1717761021
    },
    {
        "content": "<p>Thanks. So what if we change what is now called Linux to <strong>Debian (including Flatpak and Raspberry PI)</strong>? Because I believe it would be good to mention at least the PI there, as that is probably what a lot of people are using. </p>\n<p>Then we can remove the headings for both PI and Flatpak. I will check later today if the PI is mentioned anywhere else specifically, but I would think we should probably add something to the effect of \"PI users should refer to the Debian sections of this manual after installation\" in the installation section. And then PI (and flatpak) doesn't have to be mentioned separately anymore anywhere else.</p>",
        "id": 443285636,
        "sender_full_name": "Ties Brants",
        "timestamp": 1717762484
    },
    {
        "content": "<blockquote>\n<p>Debian (including Flatpak and Raspberry PI)?</p>\n</blockquote>\n<p>No. Debian does not include Flatpak. Users uses either Debian packages or Flatpak.</p>\n<blockquote>\n<p>Because I believe it would be good to mention at least the PI there, as that is probably what a lot of people are using.</p>\n</blockquote>\n<p>Mentioning Rpi is about as meaningful as mentioning \"PC\". We don't talk about PC, we talk about the packages used: Windows , Debian and Flatpak. In other words, mentioning \"PC\" is not meaningful. Nor is mentioning Rpi.</p>\n<p>Are you somehow thinking that using RPi always is done in the same awy? It is not. Exactly as a  PC an RPi can be used with all sorts of  Linux distros.  The only difference between PC and RPi is that windows packages are  not available. However, Flatpak and Debian packages are. Using these packages all sorts of LInux distros can be used.</p>",
        "id": 443321632,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1717774602
    },
    {
        "content": "<p>... and Debian does not include RPi. Most users are on Raspbian, but many other distros are used.</p>",
        "id": 443321923,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1717774708
    },
    {
        "content": "<p>Ties, my suggestion would be to follow what Alec suggests. It will be simpler and if there is user confusion later, we'll know where the problem is. Thanks very much for following through on this.</p>",
        "id": 443323357,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1717775255
    },
    {
        "content": "<p>If I may add an opinion here: I don't think most RPi users will connect the dots.  It is useful to mention RPi.  Yes, it is like saying PC.  But PC for most people means Windows.  PC Linux users know what they're doing, they made the choice consciously.  RPi is different.  People buy the device and aren't really aware of the details of the OS.</p>\n<p>Just add RPi in parenthesis at the section headers where the section applies to the common RPi OS's.</p>",
        "id": 443330484,
        "sender_full_name": "Fabio Paoli",
        "timestamp": 1717778324
    },
    {
        "content": "<p>Alec, this isn't about whether or not I know that you can use all kind of different distro's on Linux (but yes, I do). This is about if someone who has just installed a PI does. And I believe that, just as most people mean \"a computer with windows 8/10/11 \"when they say PC, most people who get a PI to run Opencpn on are not that likely to know all the details about Linux distro's. They probably just want a good chartplotter for a reasonable price and have either installed Raspberry PI OS or openplotter. </p>\n<p>The reason I included Flatpak in <strong>Debian (Including flatpak and Raspberry PI)</strong> was that you mentioned in your earlier comment that \"the differences between Flatpak and native Debian are really small, but do exist when looking at the hairy detaills installling USB hardware. However, from a more practical standpoint they could be ignored, they are hidden by simple GUI dialogs.\"</p>\n<p>Based on that it seemed to me that that statement could be made. <br>\nWould \"also applies to Flatpak and Raspberry PI (OS?)\" be a better way to say it?</p>\n<p>I will be the first to admit that I am in no way a expert on any of this, I am just trying to help to make sure that the basic manual works for people who also are not.</p>",
        "id": 443340228,
        "sender_full_name": "Ties Brants",
        "timestamp": 1717781687
    },
    {
        "content": "<p>I want to support hier <span class=\"user-mention\" data-user-id=\"720922\">@Ties Brants</span>  and <span class=\"user-mention\" data-user-id=\"721110\">@Fabio Paoli</span>  When starting with OpenCPN and Raspberry I knew that it runs some sort of unix, but I did not know then, I even did not know an hour ago, that Raspbian and Debian are so similar, that what is true for one also works for the other.</p>\n<p>I'd recommend to follow the rational of one of the first pages of this wiki:  list Debian, Ubuntu, Raspberry as different entries, but tell the user (when you click to Raspberry) that you can follow the instructions under Debian, since it is essentially identical.</p>\n<p>As a compromise: maybe you want to speak of Raspbian instead of RaspBerry Pi. Which should be changed in the install page as well.</p>",
        "id": 443343080,
        "sender_full_name": "Manfred Radmacher",
        "timestamp": 1717782882
    },
    {
        "content": "<blockquote>\n<p>Would \"also applies to Flatpak and Raspberry PI (OS?)\" be a better way to say it?</p>\n</blockquote>\n<p>These are sort of orthogonal. I asssume that you by \"Raspberry PI (OS)\" means Raspbian which is what most but not all users installs on the Rpi. To make things more interesting it's perfectlry possible to run Flatpak on top of Raspbian as long there is enough memory (i. e., RPi4 +)</p>\n<p>I think what should be done is that in some introductary part we should just state that RPi users on Raspbian should refer to the Debian packages docs.  And that's it. To all of a sudden start talking about RPi or PC   in this GNSS chapter just messes things up. </p>\n<p>In particular, as for GNSS installation there are just four documented cases: Windows, MacOS, Debian and Flatpak. Let's stick to that, and make sure RPi Raspbian users get to know that they should check for Debian in a much earlier stage.</p>",
        "id": 443358534,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1717788136
    },
    {
        "content": "<blockquote>\n<p>er (when you click to Raspberry) that you can follow the instructions under Debian, since it is essentially identical.</p>\n</blockquote>\n<p>Again: this is plain wrong. More specifically, it's only true for Raspbian users.</p>",
        "id": 443359597,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1717788422
    },
    {
        "content": "<blockquote>\n<p>When starting with OpenCPN and Raspberry I knew that it runs some sort of unix,</p>\n</blockquote>\n<p>Actually, no. It's running Linux which is not Unix.</p>",
        "id": 443360246,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1717788590
    },
    {
        "content": "<p>Okay, so we remove all mentioning of Raspberry PI in this section. </p>\n<p>And then we need to add something to the installation section to explain that if you have Raspberry PI OS (and maybe that if you are not sure that you probably  have that one as well) you should follow the instructions for Debian in the rest of the manual. </p>\n<p>Under serial USB there is also a header called <strong>How to select a device in Linux</strong> with then an explanation about Debian/Ubuntu. Maybe change Linux into Debian/Ubuntu there?</p>\n<p><span class=\"user-mention\" data-user-id=\"399510\">@Alec Leamas</span> \"Flatpak works essentially the same way as native Debian packages\" okay for Flatpak in this section?</p>",
        "id": 443364974,
        "sender_full_name": "Ties Brants",
        "timestamp": 1717790017
    },
    {
        "content": "<p>yes to both questions</p>",
        "id": 443368851,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1717790943
    },
    {
        "content": "<p>Okay, made the changes. For now the section for the PI says: See Debian. That can be removed once we actually have a section in the installation section explaining that PI OS and Openplotter users should follow the Debian sections.</p>",
        "id": 443376835,
        "sender_full_name": "Ties Brants",
        "timestamp": 1717793149
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"399510\">Alec Leamas</span> <a href=\"#narrow/stream/437623-User-Manual---Editors/topic/Connect.20to.20Global.20Navigation.20For.20Raspberry.20Pi/near/443359597\">schrieb</a>:</p>\n<blockquote>\n<blockquote>\n<p>er (when you click to Raspberry) that you can follow the instructions under Debian, since it is essentially identical.</p>\n</blockquote>\n<p>Again: this is plain wrong. More specifically, it's only true for Raspbian users.</p>\n</blockquote>\n<p>@Alec I tried to cite here (not verbatim, but as I understand) the other website. You may want to check if <a href=\"https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:quick_start_guide:installation:rpi\">https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:quick_start_guide:installation:rpi</a> is correct.</p>",
        "id": 443378786,
        "sender_full_name": "Manfred Radmacher",
        "timestamp": 1717793829
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"720693\">@Manfred Radmacher</span> I think there an important nuance  in the article you mention. Which that it is basically Debian <em>IF</em> you are using Raspberry OS. I think both you and me are saying that a lot (most?) users, especially first time users ,will be using Raspberry OS. But you don't have to. And therefore to Alec's point, Raspberry PI isn't the same as PI OS. Because you can install many other operating systems on your PI. I believe you can get Windows if you really want to.</p>",
        "id": 443381346,
        "sender_full_name": "Ties Brants",
        "timestamp": 1717794991
    },
    {
        "content": "<blockquote>\n<p>Maybe change Linux into Debian/Ubuntu there?</p>\n</blockquote>\n<p>Oops, should be <em>Debian</em>, not <em>Debian/Ubuntu</em>. My bad, sorry.</p>\n<blockquote>\n<p>I tried to cite here (not verbatim, but as I understand) the other website</p>\n</blockquote>\n<p>As Ties pointed out you missed some central parts when you did that citation. Perhaps it would be better to link to it instead?</p>\n<blockquote>\n<p>For now the section for the PI says: See Debian</p>\n</blockquote>\n<p>This is still wrong and should IMHO not be left in place since it messes up the reader's mental model  (and perhaps also the author's?).</p>\n<p>OTOH, if you change it to be a section about Raspbian and OpenPlotter it's correct and covers most of the RPi users. But as long as it is a section about RPi it's just not possible to get it right.</p>",
        "id": 443411687,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1717813552
    },
    {
        "content": "<p>Changed it to Raspberry PI OS and Openplotter. <br>\n@ the Debian/Ubuntu header. It also mentions Ubuntu in the text. Should that then also be changed into Debian only?</p>",
        "id": 443412817,
        "sender_full_name": "Ties Brants",
        "timestamp": 1717814661
    },
    {
        "content": "<p>Propably. The problem is that it is actually Debian/Raspbian/Ubuntu/... but it just becomes too complicated. Better to stick to plain <em>Debian</em> + notes in the beginning for Ubuntu users.</p>",
        "id": 443412945,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1717814813
    },
    {
        "content": "<p>Okay, also done. </p>\n<p>Think the next thing might be to decide how to explain to new PI users that they are using Debian (If they install Raspberry PI OS or Openplotter, that is of course). But maybe that should be discussed under a different name as it doesn't really have anything to do with Global Navigation. </p>\n<p><span class=\"user-mention\" data-user-id=\"399865\">@Rick Gleason</span> or anyone else suggestion on how to approach this?</p>",
        "id": 443413745,
        "sender_full_name": "Ties Brants",
        "timestamp": 1717815242
    },
    {
        "content": "<p>We have spent considerable time on this, and I gave up awhile ago as I am not a frequent user of Ubuntu or debian and I don't have an rpi.  I would leave it here and see what happens. You guys have thrashed this to death and need some perspective.</p>",
        "id": 443432322,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1717829013
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"399510\">Alec Leamas</span> <a href=\"#narrow/stream/437623-User-Manual---Editors/topic/Connect.20to.20Global.20Navigation.20For.20Raspberry.20Pi/near/442965326\">said</a>:</p>\n<blockquote>\n<p>Sorry for long post. Short message: There is no need to document any Rpi GNSS installation use case, just Debian. Flatpak is actually identical.</p>\n<p><div class=\"codehilite\" data-code-language=\"alec\"><pre><span></span><code>\n</code></pre></div><br>\n</p>\n</blockquote>",
        "id": 472214659,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1727094177
    },
    {
        "content": "<p>Under Connect to GNSS <br>\n<a href=\"https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:quick_start_guide:connect_to:global_navigation_satellite_system\">https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:quick_start_guide:connect_to:global_navigation_satellite_system</a><br>\nWe do not list RPI, I assume that is what you wanted.</p>\n<p>Is this page ok for RPI now?<br>\n<a href=\"https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:quick_start_guide:installation:rpi\">https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:quick_start_guide:installation:rpi</a></p>",
        "id": 472215154,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1727094319
    },
    {
        "content": "<p>Yes, besides I'd say 4Gb of ram is the practical minimum</p>",
        "id": 472215723,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1727094464
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"399865\">Rick Gleason</span> <a href=\"#narrow/stream/437623-User-Manual---Editors/topic/Connect.20to.20Global.20Navigation.20For.20Raspberry.20Pi/near/472215154\">said</a>:</p>\n<blockquote>\n<p>We do not list RPI, I assume that is what you wanted.</p>\n</blockquote>\n<p>Indeed. There is no such thing as RPi in this context. What we have is Debian, Ubuntu, various distros + Flatpak. This is the difference, the hardware doesn't matter once the os ins installed</p>",
        "id": 472216338,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1727094614
    },
    {
        "content": "<p>Looking at the Keyboard shortcuts page at <a href=\"https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:ui_user_interface:keyboard_shortcuts\">https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:ui_user_interface:keyboard_shortcuts</a></p>\n<p>Is this really a user-friendly way to organize this info? It basically gives an answer to the question \"What happens if I press R\" or something like that. But the natural question for a user is rather \"How do I do this or that using a shortcut?\" As it is now, things like the measure tool is spread out at multiple places. </p>\n<p>This is IMHO not that user friendly. The new ? page organization is probably better, listing the actions together with all  involved keys. Should we do the same in the manual?</p>",
        "id": 472661332,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1727259747
    },
    {
        "content": "<p>Alec how would I get to the new key organization now?  So I can look at it. Thanks.<br>\nI observe that the current organization makes it easier to find unused key combinations, but your point might take precedence.</p>",
        "id": 472674380,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1727263911
    },
    {
        "content": "<p>Just have a look at  the new '?' page,  for example the screenshot at <a href=\"https://github.com/OpenCPN/OpenCPN/discussions/4145#discussioncomment-10720045\">https://github.com/OpenCPN/OpenCPN/discussions/4145#discussioncomment-10720045</a>. The manual have more space and cold expand on the brief summaries in the page.</p>\n<p>But the basic structure is simple: Two columns, the first describing \"What\"  and the second all related keys.</p>\n<p>From a user perspective we should IMHO not have different headings for Funcion Keys,  Shortcut Keys, Alt Keys and Ctrl Keys. As a user I only care about how to get things done. If it's a ctrl. alt, function or plain key doesn't really matter</p>",
        "id": 472675487,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1727264285
    },
    {
        "content": "<p>Looking more at that page: The best is probably to update the table at top and make sure that everything mentioned under Funcion Keys, Shortcut Keys, Alt Keys and Ctrl Keys is in the table. Then remove the rest, it's just a pain to maintain and is irrelevant.</p>\n<p>The table is space-constrained. Perhaps better to rename the Comments column to Notes, and  just put a digit like 1) in the table and the expanded explanation below.</p>",
        "id": 472676461,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1727264619
    },
    {
        "content": "<p>... and just one row when there are multiple bindings. For example a single row for \"Zoom In\" with the  keys \"+, PgUp\"</p>",
        "id": 472677131,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1727264827
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"399510\">Alec Leamas</span> <a href=\"#narrow/stream/437623-User-Manual---Editors/topic/Shortcuts.20page.20organization/near/472676461\">said</a>:</p>\n<blockquote>\n<p>Looking more at that page: The best is probably to update the table at top and make sure that everything mentioned under Funcion Keys, Shortcut Keys, Alt Keys and Ctrl Keys is in the table. Then remove the rest, it's just a pain to maintain and is irrelevant.</p>\n<p>The table is space-constrained. Perhaps better to rename the Comments column to Notes, and  just put a digit like 1) in the table and the expanded explanation below.</p>\n</blockquote>\n<p>\"Then remove the rest, it's just a pain to maintain and is irrelevant.\"<br>\nAlec, I beg to differ here. It is just a pain to figure out what is available if it is in this form, but for the user, the Table at the top was created for the primary keyboard shortcuts.<br>\nI would like to keep the lower part for that reason (only in the wiki perhaps).</p>\n<p>I understand you are very space constrained for antora, but there are lots of other shortcuts available that are important. Is there any way to expand it?  I added a bunch of suggestions in the issue you linked to.</p>",
        "id": 472683325,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1727266887
    },
    {
        "content": "<blockquote>\n<p>I understand you are very space constrained for antora</p>\n</blockquote>\n<p>This has nothing to do with antora.</p>\n<blockquote>\n<p>but for the user, the Table at the top was created for the primary keyboard shortcuts.</p>\n</blockquote>\n<p>This is  the User Manual, and what's should be targeting users. And the table is indeed the right form,  but it lacks a lot of  bindings  described in the rest.</p>\n<blockquote>\n<p>it is just a pain to figure out what is available if it is in this form </p>\n</blockquote>\n<p>What is the use case  for the rest? Really?</p>",
        "id": 472683947,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1727267090
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"399510\">Alec Leamas</span> <a href=\"#narrow/stream/437623-User-Manual---Editors/topic/Shortcuts.20page.20organization/near/472215723\">said</a>:</p>\n<blockquote>\n<p>Yes, besides I'd say 4Gb of ram is the practical minimum</p>\n</blockquote>\n<p>I changed it as you suggested</p>",
        "id": 472684073,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1727267137
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"399510\">Alec Leamas</span> <a href=\"#narrow/stream/437623-User-Manual---Editors/topic/Shortcuts.20page.20organization/near/472676461\">said</a>:</p>\n<blockquote>\n<p>Looking more at that page: The best is probably to update the table at top and make sure that everything mentioned under Funcion Keys, Shortcut Keys, Alt Keys and Ctrl Keys is in the table. Then remove the rest, it's just a pain to maintain and is irrelevant.</p>\n<p>The table is space-constrained. Perhaps better to rename the Comments column to Notes, and  just put a digit like 1) in the table and the expanded explanation below.</p>\n</blockquote>\n<p>Yes, I can rejigger the User Table at the top to match what you linked to, and then<br>\nhave comments at the bottom.</p>\n<p>Are you space constrained width wise only?<br>\nCan we add lines to the bottom?</p>\n<p>As far as the Function and Ctrl lists at the botttom, can't we keep them in the wiki, but not in the  offline antora documentation?</p>",
        "id": 472684812,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1727267365
    },
    {
        "content": "<blockquote>\n<p>but not in the offline antora documentation?</p>\n</blockquote>\n<p>Again: there is no such thing</p>",
        "id": 472685335,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1727267519
    },
    {
        "content": "<blockquote>\n<p>As far as the Function and Ctrl lists at the botttom, can't we keep them in the wiki</p>\n</blockquote>\n<p>If you can describe the use case, so why not. But can you? I  honestly does not  see how it can be useful for an end user.</p>",
        "id": 472685627,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1727267601
    },
    {
        "content": "<blockquote>\n<p>but not in the offline antora documentation?</p>\n</blockquote>\n<p>Ah.. now I understand what you mean. But the answer is no, the process from wiki to antora is mostly automatic and we should not add more manual steps to it.</p>",
        "id": 472686083,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1727267739
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"399510\">Alec Leamas</span> <a href=\"#narrow/stream/437623-User-Manual---Editors/topic/Shortcuts.20page.20organization/near/472685335\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>but not in the offline antora documentation?</p>\n</blockquote>\n<p>Again: there is no such thing</p>\n</blockquote>\n<p>Alec, where am I supposed to be editing this?  We have the official Dokuwiki Manual and you and Pavel have converted that to Antora, so there is some other github repository that has that conversion.  We now have two versions of the manual. I and other users have been maintaining and updating the Dokuwiki and had planned on doing the Advanced Manual this fall.  What is the plan here?  My users and editing team is not familiar with antora and it is much easier to do in Dokuwiki. I can't ask them all to learn Git, it just cannot be expected, and furthermore, for document creation and editing Dokuwiki can't be beat.</p>",
        "id": 472686506,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1727267866
    },
    {
        "content": "<p>For now, you are expected to edit the Dokuwiki. From time to time, Pavel will convert it to Antora; the conversion now is not the last one. And the antora source should not be maintained in any other way for now.</p>",
        "id": 472686962,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1727267996
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"399510\">Alec Leamas</span> <a href=\"#narrow/stream/437623-User-Manual---Editors/topic/Shortcuts.20page.20organization/near/472686083\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>but not in the offline antora documentation?</p>\n</blockquote>\n<p>Ah.. now I understand what you mean. But the answer is no, the process from wiki to antora is mostly automatic and we should not add more manual steps to it.</p>\n</blockquote>\n<p>Humm, I think this is very good news for us editors.  Maybe we can have the best of both worlds!    <strong><em>Dokuwiki ---&gt; Antora is mostly Automatic</em></strong>????</p>\n<p>Ok, can we reach a compromise here.  Can I put the stuff at the bottom that you don't want, in another page?  Say a subpage?</p>",
        "id": 472687477,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1727268128
    },
    {
        "content": "<blockquote>\n<p>, for document creation and editing Dokuwiki can't be beat.</p>\n</blockquote>\n<p>This is your opinion. If it was a common way to see it we would have a lot of projectys moving from frameworks like Antora to the \"can't be beaten\" Dokuwiki.</p>\n<p>However, the truth  is  that the direction goes  the other way. More and more project abandons the ancient wike style docs an favor asciidoc and Antora-like  solutions.</p>\n<p>But we have a legacy, I recognize that and right now we should probably don't rock the boat. But long term, I don't see our documentation on Wiki style sites.</p>",
        "id": 472688073,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1727268296
    },
    {
        "content": "<blockquote>\n<p>Ok, can we reach a compromise here. Can I put the stuff at the bottom that you don't want, in another page? Say a subpage?</p>\n</blockquote>\n<p>The decision is in the end yours. But if you cannot answer the question \"In what end-user situation is this useful\" you should think IMHO twice.</p>",
        "id": 472688462,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1727268403
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"399510\">Alec Leamas</span> <a href=\"#narrow/stream/437623-User-Manual---Editors/topic/Shortcuts.20page.20organization/near/472688073\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>, for document creation and editing Dokuwiki can't be beat.</p>\n</blockquote>\n<p>This is your opinion. If it was a common way to see it we would have a lot of projectys moving from frameworks like Antora to the \"can't be beaten\" Dokuwiki.</p>\n<p>However, the truth  is  that the direction goes  the other way. More and more project abandons the ancient wike style docs an favor asciidoc and Antora-like  solutions.</p>\n<p>But we have a legacy, I recognize that and right now we should probably don't rock the boat. But long term, I don't see our documentation on Wiki style sites.</p>\n</blockquote>\n<p>Yes, this is my opinion and EXPERIENCE.  Our team, and the last group of editors were great, and they learned and accommodated to the process quite quickly for the most part. I am quite certain that the Antora method will take quite awhile to catch on, but let's hope it does. For the time being, I think we need to persevere with  Dokuwiki even though you don't like it, otherwise we will not have a team to get the work done!   Also we need passionate users involved as they see things differently than those from the programming side, and they have a way of making the manual understandable for regular users.</p>",
        "id": 472688964,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1727268536
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"399510\">Alec Leamas</span> <a href=\"#narrow/stream/437623-User-Manual---Editors/topic/Shortcuts.20page.20organization/near/472688462\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>Ok, can we reach a compromise here. Can I put the stuff at the bottom that you don't want, in another page? Say a subpage?</p>\n</blockquote>\n<p>The decision is in the end yours. But if you cannot answer the question \"In what end-user situation is this useful\" you should think IMHO twice.</p>\n</blockquote>\n<p>Ok, as the last comment, below the table, I could  make a link to a separate page that is located under the Editor Manual, but that seems a little ridiculous. That would be a page going to an entirely different \"book\".    I am pretty sure Antora wouldn't like that.  So I am just going to make it a sub-page.</p>",
        "id": 472692197,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1727269397
    },
    {
        "content": "<p><strong><em>Summary of changes needed</em></strong></p>\n<ol>\n<li>The manual has more space and could expand on the Table in the page.</li>\n<li>Keyboard Shortcut Table  with 2 columns  what  and  all related keys.</li>\n<li>Expand the Table to include everything under Function Keys, Shortcut Keys, Alt Keys and Ctrl Keys.</li>\n<li>Move  the Function Keys, Shortcut Keys, Alt Keys and Ctrl Keys to a sub-page.</li>\n<li>Use just one row when there are multiple actions. Example \"Zoom In\" with the keys \"+, PgUp\" on one row.</li>\n<li>Table is space constrained in the width direction only. Change \"Comments\" to \"Notes\"</li>\n<li>Add referenced Comments below following the note numbers.</li>\n</ol>\n<p>Current Antora status - emulate.<br>\n<a href=\"#narrow/stream/437623-User-Manual---Editors/topic/Shortcuts.20page.20organization/near/472676461\">7:43 AM</a></p>\n<p>I should be able to get this done in a couple of days.</p>",
        "id": 472700622,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1727271742
    },
    {
        "content": "<p>@leamas <span class=\"user-mention\" data-user-id=\"573239\">@Pavel Kalian</span>  <span class=\"user-mention\" data-user-id=\"517002\">@Dave Register</span> </p>\n<p><a href=\"https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:ui_user_interface:keyboard_shortcuts\">https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:ui_user_interface:keyboard_shortcuts</a></p>\n<p>I have spent the better part of the day revising the <strong>Keyboard Shortcut Table</strong>. It is impossible to have a comprehensive Table without the notes follow.   There are some FIXME s and clarifications needed about Changing Color Schemes. Some of this language can certainly be improved and clarified.  There may be some other notes that can be eliminated with some review. I would appreciate it one of you would look at this.</p>\n<p>Also I have moved the Keyboard Shortcuts sorted by Key to a sub-page, for preservation, sanity, and speed in determining what is used and what is not used.</p>\n<p>Rick</p>",
        "id": 472760307,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1727292018
    }
]