[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"399865\">@Rick Gleason</span> <span class=\"user-mention\" data-user-id=\"720913\">@John Morfit</span> </p>\n<p>In my efforts to see a consistent  and clear nomenclature in the GUI of OpenCPN regarding Marks and Waypoints, I made a proposal to Rick, and forwarded it to Dave, and he implemented it.</p>\n<p>The bottomline is: marks are called marks, and points in a route are called waypoints.</p>\n<p>However, this makes it more difficult to explain the relation between marks and routes/waypoints and how they are saved in gpx files.</p>\n<p>Rick created a page in the wiki, which tries to explain this: <a href=\"https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:terminology:marks_waypoints\">https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:terminology:marks_waypoints</a></p>\n<p>I believe it needs an intro, to make things really clear. I added a first draft of such an intro to the Rick's page above.</p>\n<p>In my opinion, a similar intro will be needed in <a href=\"https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:route_manager:use_gpx_files\">https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:route_manager:use_gpx_files</a></p>\n<p>Sorry for causing extra work here, but I believe the GUI has improved since it now uses a consistent nomenclature.</p>\n<p>Manfred</p>",
        "id": 442105729,
        "sender_full_name": "Manfred Radmacher",
        "timestamp": 1717362768
    },
    {
        "content": "<p>Manfred go ahead and finish it the way it needs to be.  <br>\nMake sure that this point gets across \"The bottomline is: marks are called marks, and points in a route are called waypoints.\"<br>\nI am sure John would not mind you adding to Use_gpx files, he'll then review and make some improvements. Thanks!</p>",
        "id": 442111493,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1717366191
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"720693\">@Manfred Radmacher</span>   and  <span class=\"user-mention\" data-user-id=\"720913\">@John Morfit</span>  <br>\nWe have some pages that need to be reviewed carefully starting with the definitions for Marks and Waypoints.<br>\nAs a result of the program name changes we need to review all the pages under Create Route and Manage Routes with this in mind.</p>\n<p>Terminology Marks and WP  -  Manfred, In looking at this , I agree that some of the gpx code is duplicated or almost duplicated with Use_GPX Files,  can the GPX FIles document be made to show the differences of &lt;rte&gt; and &lt;wpt&gt; and how Marks (poi) become Waypoints (part of a route).   John and Manfred will need to coordinate and discuss this.</p>\n<p>Then the Terminology page can be very simple distinction description defining Marks and Waypoints.  OK?</p>",
        "id": 442116707,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1717370279
    },
    {
        "content": "<p>I'm left asking myself, what really changed? Is there any change in the code, or the UI? Is all this just terminology?<br>\nSure, I'll try to iron out Use GPX.<br>\nI see in opencpn:manual_basic:route_manager:waypointtab.jpg that the Waypoint tab is labeled Marks, which doesn't match my beta OpenCPN.</p>",
        "id": 442119244,
        "sender_full_name": "John Morfit",
        "timestamp": 1717372491
    },
    {
        "content": "<p>ok, I installed the latest from Cloudsmith, now I start to see changes. I fixed the old image in Navigation Sharing.</p>",
        "id": 442121160,
        "sender_full_name": "John Morfit",
        "timestamp": 1717373657
    },
    {
        "content": "<p>John you need to update Opencpn unreleased.   Ok you did it. Also here is the Issue where the discussion occurred.<br>\nSorry, it happened so fast, we did not know what bdbcat would decide, but I think it is the right thing to do.<br>\n<a href=\"https://github.com/OpenCPN/OpenCPN/issues/3952\">https://github.com/OpenCPN/OpenCPN/issues/3952</a></p>",
        "id": 442121275,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1717373742
    },
    {
        "content": "<p>thanks Rick. Ok, I've updated Use GPX and Navigation Sharing to refer to \"Route &amp; Mark Manager\". I've updated image captures.  I've modified the wording in Navigation Sharing  extensively, to refer mostly to Mark, rather than Waypoint.  Use GPX for the most part refers to Waypoint, as that is the name of the xml element. @Manfred Radmacher, please review and let me know if I'm getting this correct.</p>",
        "id": 442243799,
        "sender_full_name": "John Morfit",
        "timestamp": 1717419008
    },
    {
        "content": "<p>Looks good to me John, but I will be reading mostly all the pages under Manage Routes tonight.</p>",
        "id": 442310229,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1717432979
    },
    {
        "content": "<p>@John: I had a quick look at the page UseGPXfiles.</p>\n<p>The issue is that OPenCPN implements marks with &lt;wpt&gt;  elements, but uses the word waypoint for the points in a route  using the &lt;rtept&gt; element.<br>\nThis is confusing and may stay confusing for the reader.</p>\n<p>My suggestion: use wpt and rtept and so forth when you refer to the elements of the gpx files, and use the clear phrases mark and waypoint only in the sense they are used in the GUI of OpenCPN.</p>\n<p>I added a short sentence defining mark and another adressing the difference between the words waypoint and mark and the corresponding elements in gpx: wpt and rtept.</p>\n<p>and I placed two FIXME, where the confusion between marks and waypoints needs to be fixed.</p>",
        "id": 442384759,
        "sender_full_name": "Manfred Radmacher",
        "timestamp": 1717452951
    },
    {
        "content": "<p>Yes  Manfred , however if you don't directly make the connections clear at the beginning, users will assume the wrong thing.  Best to set it out clearly at the beginning, then follow your suggestion I think.</p>",
        "id": 442410171,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1717463285
    },
    {
        "content": "<p>I agree fully. This was my intention when adding a couple of sentences at the beginning of \"use gpx files\".</p>\n<p>It looks to me that the information in the page you added Terminology -&gt; Marks &amp; Waypoint is covered in \"use gpx files\". So, one of them is obsolete.</p>\n<p>I added the definition of mark and changed the definition of waypoint in Terminology</p>\n<p>And I finished the three pages on marks in Manage Routes</p>",
        "id": 442441887,
        "sender_full_name": "Manfred Radmacher",
        "timestamp": 1717478207
    },
    {
        "content": "<p>Manfred, I've rewritten this extensively. I think it can stand alone now.<br>\n<a href=\"https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:terminology:marks_waypoints\">https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:terminology:marks_waypoints</a></p>",
        "id": 442513781,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1717502749
    },
    {
        "content": "<p>I think this page is done, but perhaps should have some additional review.<br>\n<a href=\"https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:terminology:marks_waypoints\">https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:terminology:marks_waypoints</a></p>\n<p>This page has one fixme regarding providing  an Example Single Waypoint and Example Multiple Waypoints.<br>\n<a href=\"https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:route_manager:use_gpx_files\">https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:route_manager:use_gpx_files</a></p>",
        "id": 442522180,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1717505384
    },
    {
        "content": "<p>ok, i've repaired the Use GPX section. It should have addressed the fixme's and should be done.<br>\np.s. I'm going on passage from Bahamas to USA today, so I'll be offline until Thursday.</p>",
        "id": 442538835,
        "sender_full_name": "John Morfit",
        "timestamp": 1717510148
    },
    {
        "content": "<p>Thanks John for everything. Have a great trip.</p>",
        "id": 442539642,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1717510343
    }
]