[
    {
        "content": "<p>I found that 'Track' is covered in six places in the docs, which I think is too many. There is also duplicate text. I'm working on consolidating into two places and will put the proposed draft pages under \"STAGING PAGES\". Let me know if you make changes to any of the existing 'Track' pages so I can incorporate your changes.</p>",
        "id": 439247243,
        "sender_full_name": "Terry Slattery",
        "timestamp": 1715959935
    },
    {
        "content": "<p>I've added three pages under STAGING that could be reviewed.  The internal links may not all be good because at this point I'm looking for whether this improves the Tracking documentation. I think I've eliminated all the duplicate text and streamlined the topic. The three resulting pages are Toggle Tracking, Own_Ship/Tracking, and Manage Routes/Tracks (this is where the bulk of the prior info is located).</p>\n<p>Thanks!<br>\n  -tcs</p>\n<p><span class=\"user-mention silent\" data-user-id=\"720743\">Terry Slattery</span> <a href=\"#narrow/stream/437623-User-Manual---Editors/topic/Vessel.20track.20documentation.20proposed.20changes/near/439247243\">said</a>:</p>\n<blockquote>\n<p>I found that 'Track' is covered in six places in the docs, which I think is too many. There is also duplicate text. I'm working on consolidating into two places and will put the proposed draft pages under \"STAGING PAGES\". Let me know if you make changes to any of the existing 'Track' pages so I can incorporate your changes.</p>\n</blockquote>",
        "id": 439291230,
        "sender_full_name": "Terry Slattery",
        "timestamp": 1715979712
    },
    {
        "content": "<p>I think this is very good Terry. The original manual in Drupal was about 30 pages, now many years later, just the Basic Manual is about 120 pages I think, (if that is any measure), so I applaud your effort to consolidate, eliminate duplication and simplify.<br>\nThank you. Rick</p>",
        "id": 439348667,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1716032122
    },
    {
        "content": "<p>I replied to the questions you left in the FIXME header notes for the proposed Tracks changes. Summary: The proposal is for three pages: Toggle Tracking, Own Ship &gt; Tracking (where there are some settings - ideally these would be moved into the Tracks Tab), and Tracks Tab. My objective is to avoid the user from having to search multiple pages of documentation, searching for the control they they know exists but don't remember where. An alternative is to add links between all the different pages that discuss tracks, but I think this alternative complicates the docs.</p>",
        "id": 439365135,
        "sender_full_name": "Terry Slattery",
        "timestamp": 1716047957
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"720743\">@Terry Slattery</span>  I think these changes are an improvement and would support it but I would like to hear from MerMike who had done the majority of the work on the Track pages. I will contact him directly.  Regarding the Set Options section, this is one of the key areas of the program, it is the way the program is structured, and the manual does mirror that. I personally do not want the manual to stray from representing Options completely and in one place.</p>\n<p>I would support however, links to the particular option setting paragraph, or to avoid a link, even a small screenshot and brief explanation within the text of the page being worked on.  However Set Options [Options] should stand on its own intact and not be cut into pieces and placed in different pages (if that was what you were suggesting). </p>\n<p>Also from a practical standpoint, that is a huge change that we cannot accomplish within the timeframe that we have available.</p>",
        "id": 439430592,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1716117291
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"720743\">@Terry Slattery</span>   Also I note that the Automatic Tracking in Options and in the Use Tracks page are not duplicates, Mermike has given us additional information about Auto Tracking in the paragraph in Use Tracks, based upon his testing.</p>",
        "id": 439431299,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1716118044
    },
    {
        "content": "<p>Greetings,  I've been visiting family and also wasn't awate of Zulip, but have finally made my way here. </p>\n<p>I have tried to consolidate tracking as best i can. As <span class=\"user-mention\" data-user-id=\"720743\">@Terry Slattery</span> notes,  it was exceedingly lengthy and there was quite a bit of duplication. The only remaining function i haven't reviewed is Extend Track. </p>\n<p>I thought i had accomplished most of the updates before <span class=\"user-mention\" data-user-id=\"720743\">@Terry Slattery</span> comments but it's certainly possible that more can be done to consolidate. The discussion of Auto Tracking was moved to Use Tracks. The only items under Ships&gt;Own Ship&gt;Tracking are the settings.</p>",
        "id": 439480809,
        "sender_full_name": "Mike Guryan",
        "timestamp": 1716167658
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"720704\">Mike Guryan</span> has marked this topic as resolved.</p>",
        "id": 439481555,
        "sender_full_name": "Notification Bot",
        "timestamp": 1716168438
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"720704\">Mike Guryan</span> has marked this topic as unresolved.</p>",
        "id": 439481617,
        "sender_full_name": "Notification Bot",
        "timestamp": 1716168485
    },
    {
        "content": "<p>I looked that the staging pages and now I'm a bit confused as to what Terry is proposing and where his suggestions fit into the timeline of changes that have already been made.</p>\n<p>There are several sections that need to be filled out, but I'm not sure what another reorganization accomplishes. I guess i don't see the benefit. After putting significant effort into this I'm a bit discouraged. </p>\n<p>The topic of tracking appears in 3 places:</p>\n<p>Options&gt;Ships&gt;Own Ship&gt;Tracking (settings for Automatic Daily Tracks)<br>\nRoute Manager - Tracks Tab (Description of Track Properties and controls) <br>\nUse Tracks (How to use the various Properties and controls)</p>\n<p>If you consolidate further you end up with one or two very long pages that require a lot of scrolling,  which is cumberson.</p>",
        "id": 439482556,
        "sender_full_name": "Mike Guryan",
        "timestamp": 1716169544
    },
    {
        "content": "<p>I also note that tracking is covered in toggle tracking, but the text is (or should be) limited to the use of the button, with links to other tracking topics.</p>",
        "id": 439605552,
        "sender_full_name": "Mike Guryan",
        "timestamp": 1716221595
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"720704\">@Mike Guryan</span> First, please don't be discouraged. Our work overlapped in time. Zulip should make it easier to communicate up front.</p>\n<p>I found tracking covered in six places, which can lead to a \"where is that option/setting\" feeling for users, which is why I proposed consolidation. I didn't want to start editing on the existing pages without a discussion, so I created the staging pages.  Making sure that the different pages are properly linked will help users.</p>\n<p>Question: Do you know why Automatic Daily Tracks exists, I.e., why reset daily?</p>\n<p>I have some text for Track Tab &gt; Track to Route and Track Properties items in the Staging Pages I created. There is also some text for items in Use Tracks. Do the items match your understanding of the functions? </p>\n<p>The Use Tracks reference to Track Precision should be a link to Own Ship#Tracks?</p>",
        "id": 439678433,
        "sender_full_name": "Terry Slattery",
        "timestamp": 1716238570
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"720743\">@Terry Slattery</span>  - </p>\n<p>First question, why Automatic Daily Tracks exists, I.e., why reset daily. I can think of several reasons:</p>\n<ol>\n<li>If OCPN was left open and tracking left on for an extended period, the size of a GPX file for a single track could concievably exceed usable/useful limits.</li>\n<li>Ship's logs typically cover a daily period, whether coastal cruising or on a passage. Locating position information in a track is simplified if you know which date it occured on. I can't imagine trying to find where I was on a long passage if it was in a single GPX file.</li>\n<li>Rotating the track log file daily was probably far simpler than trying to rotate it on a per-watch basis.</li>\n</ol>\n<p>I would add the following to Route from Track:</p>\n<p>Creates a route from track data. The new route will appear in the Route &amp; Mark Manager and will have the same name as the track. Depending on the precision used to create the track, it is recommended to use the Reduce Data function on a track prior to converting it to a Route. This will reduce the number of waypoints.</p>\n<p>The Use Tracks reference to Track Precision should be a link to Own Ship#Tracks?<br>\nA link would be good. I need to better understand how to create bookmarks in the editor so that more fine-grained links can be created. I would have created one if I knew how.</p>\n<p>In general, the purpose of the Tracks Tab page in the manual is to provide a basic description of the controls. The Use tracks page is to provide more detailed information and use cases.</p>\n<p>The fact the the controls for Automatic Daily Tracks is under Ships&gt;Own Ship pretty much requires that we at least describe the options there, with more details and use cases provided in the Use Tracks page. In a similar vein, the fact that the Tracking toggle is i't own button on the toolbar requires that we describe it there.</p>\n<p>I can see consolidating the Tracks Tab and Track Properties pages, but it will be long. That's my primary reason for separating them in the first place. </p>\n<p>FYI, I revisited the Tracks Property pages and realized there was still more to do there. I added FIXME notes where needed.</p>",
        "id": 439684049,
        "sender_full_name": "Mike Guryan",
        "timestamp": 1716240821
    },
    {
        "content": "<p>Mike  I added this paragraph as you wanted<br>\nto Route from Track:<br>\nCreates a route from track data. The new route will appear in the Route &amp; Mark Manager and will have the same name as the track. Depending on the precision used to create the track, it is recommended to use the Reduce Data function on a track prior to converting it to a Route. This will reduce the number of waypoints.</p>\n<p>For a tracking precision link, I just added <br>\n  [[opencpn:manual_basic:set_options:ships:own_ship#tracking_precision|Tracking Precision]]<br>\nSee  <a href=\"https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:route_manager:use_tracks\">https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:route_manager:use_tracks</a></p>",
        "id": 439714223,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1716256461
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"720743\">@Terry Slattery</span>  and  <span class=\"user-mention\" data-user-id=\"720704\">@Mike Guryan</span>  There are still some FIXME in the Tracks pages. One of them regards RoutePoints  - what is this referring to?  Can we get it Fixed?  Also missing descritions for  Split and Extend Track   we need these done too.  Thanks.</p>",
        "id": 440632405,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1716639566
    },
    {
        "content": "<p><a href=\"https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:route_manager:use_tracks\">https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:route_manager:use_tracks</a>   Has a fixme for Extend tracks too.  Maybe refer one to the other with a link, if it is  more than 3 lines?</p>",
        "id": 440632503,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1716639668
    },
    {
        "content": "<p>Would like to label these Track pages as DONE,  soon. Thanks.</p>",
        "id": 440632602,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1716639780
    },
    {
        "content": "<p>I can finish up this weekend. I'm on a plane most of the day tomorrow with Wifi. There are no Route Points, it will be deleted.</p>",
        "id": 440637994,
        "sender_full_name": "Mike Guryan",
        "timestamp": 1716645125
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"720704\">@Mike Guryan</span> In Track Properties I changed \"For more detail, see Extend Track.\" to \"For more detail, see Use Track &gt; Extend Track.\" in order to differentiate it from this page (which also contains an Extend Track). I'm going to consider this done and remove your \"Needs Review\" comment in the Status &amp; Progress page.</p>",
        "id": 440898810,
        "sender_full_name": "Terry Slattery",
        "timestamp": 1716832938
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"720704\">@Mike Guryan</span> Use Tracks looks good to me so I'll also remove your \"Needs Review\" note and we can call them DONE.</p>",
        "id": 440899371,
        "sender_full_name": "Terry Slattery",
        "timestamp": 1716833234
    },
    {
        "content": "<p>Sounds good. Thanks for looking them over.</p>",
        "id": 440900063,
        "sender_full_name": "Mike Guryan",
        "timestamp": 1716833610
    },
    {
        "content": "<p>Mike your 3 tracks pages look good to me. I see they are Done Thanks for your effort, it is much appreciated.  Terry thanks for looking them over.</p>",
        "id": 441984616,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1717285775
    }
]