[
    {
        "content": "<p>Akec...apologies... I had not carried the typo fix across to my Intel machine.  Now done so and have seen no error .  Also it does not recompile all of wxWidgets after rerunning <a href=\"http://circleci-build-macos.sh\">circleci-build-macos.sh</a>, so it must be caching the builds OK. All much better on Intel.</p>\n<p>Will try your arm patches when I can.</p>",
        "id": 338819669,
        "sender_full_name": "Tony Voss",
        "timestamp": 1677672650
    },
    {
        "content": "<p>No need to appologize. Happy that it works for you.</p>\n<p>To get ir running on arm is probably more than the patch I described, but the patch would be a first step.</p>",
        "id": 338844720,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1677678496
    },
    {
        "content": "<p><a href=\"https://github.com/Rasbats/shipdriver_pi/issues/504\">https://github.com/Rasbats/shipdriver_pi/issues/504</a></p>",
        "id": 338850482,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1677679807
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"399510\">@Alec Leamas</span>  Now applied your patches to  <code>MacosWxwidgets</code>.  <code>circleci-build-macos.sh</code> ran OK.<br>\nOn first <em>make tarball</em>, still errors.  I note:</p>\n<ol>\n<li>Lines 9-10: It has got the right idea.</li>\n<li>Several warnings worth looking at.  Some say that it cannot find something an so will use the built-in one. That's OK if it is something it is using for the build process.  Not good if it is building it into the tarball.</li>\n<li>Line 230 significant?</li>\n<li>Line 274 seems a significant error. </li>\n<li>Lines 285-290 Might this be consequence of the above?   The cache/lib folder contains just </li>\n</ol>\n<ul>\n<li>libwx_baseu_net-3.2.0.1.0.dylib</li>\n<li>libwx_baseu-3.2.0.1.0.dylib</li>\n<li>and aliases to them</li>\n<li>There is no wx subdirectory that it is looking for</li>\n</ul>\n<p><a href=\"/user_uploads/33951/RkOTQbC6cP15j_oIQ92VE5D8/BuildOnArmTerminalOutput.txt\">BuildOnArmTerminalOutput.txt</a></p>",
        "id": 338907216,
        "sender_full_name": "Tony Voss",
        "timestamp": 1677691655
    },
    {
        "content": "<blockquote>\n<p>checking build system type... Invalid configuration <code>arm64-apple-darwin': machine </code>arm64-apple' not recognized</p>\n</blockquote>\n<p>This is the core issue so far. I have no idea what this means, it might be that it's necessary to re-generate configure but ...<br>\nI figure you can run this on your x86 box for now. Let me think about it, back later.</p>",
        "id": 338908206,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1677691874
    },
    {
        "content": "<p>5 messages were moved here from <a class=\"stream-topic\" data-stream-id=\"332200\" href=\"/#narrow/stream/332200-shipdriver/topic/shipdriver.203.2E2\">#shipdriver &gt; shipdriver 3.2</a> by <span class=\"user-mention silent\" data-user-id=\"399510\">Alec Leamas</span>.</p>",
        "id": 340060427,
        "sender_full_name": "Notification Bot",
        "timestamp": 1678182293
    },
    {
        "content": "<p>The PR is fine but some comments on github:<br>\n<a href=\"https://github.com/Rasbats/shipdriver_pi/issues/505\">https://github.com/Rasbats/shipdriver_pi/issues/505</a></p>",
        "id": 340091487,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1678190739
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"399559\">@Mike Rossiter</span>  And now I chjery-picked more or less the same commit which you reverted. Hopefully no one reviews our history ;)</p>\n<p>Time for a new release? The macos fixes not that important IMHO, but the opencpn-libs update is.</p>",
        "id": 340391158,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1678288896
    },
    {
        "content": "<blockquote>\n<p>Time for a new release?</p>\n</blockquote>\n<p>Yes it is. Please go ahead.</p>",
        "id": 340391869,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1678289029
    },
    {
        "content": "<p>OK, will do before end of day.</p>",
        "id": 340395421,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1678289803
    },
    {
        "content": "<p><a href=\"https://github.com/OpenCPN/OpenCPN/discussions/3063\">https://github.com/OpenCPN/OpenCPN/discussions/3063</a></p>",
        "id": 340470118,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1678311852
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"399510\">Alec Leamas</span> <a href=\"#narrow/stream/332200-shipdriver/topic/Building.20on.20m1.2Farm.20Macs/near/338908206\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>checking build system type... Invalid configuration <code>arm64-apple-darwin': machine </code>arm64-apple' not recognized</p>\n</blockquote>\n<p>This is the core issue so far. I have no idea what this means, it might be that it's necessary to re-generate configure but ...<br>\nI figure you can run this on your x86 box for now. Let me think about it, back later.</p>\n</blockquote>\n<p>Any progress on being able to build on arm for x86 deployment, please?<br>\nFor now I am building on an old Intel Mac and transferring tarballs to my M2 Mac.<br>\nBut it is a bit of a hassle and I will not be taking the old Mac to sea at the end of April.</p>",
        "id": 343321275,
        "sender_full_name": "Tony Voss",
        "timestamp": 1679392501
    },
    {
        "content": "<p>no, not really, and short of time.</p>",
        "id": 343400817,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1679411628
    },
    {
        "content": "<p>I was also getting fed up with having to juggle between my M1 and Intel Mac, so I figured I'd give it a go and it turned out to be not so hard.<br>\nI just submitted a PR against ShipDriver so you can see what it entails. It's really only a few lines that cause the cached wxWidgets to be built in universal (both x86_64 and arm64) mode, and then you can build either \"normal\", \"universal\" or \"crossbuilds\" by setting <code>CMAKE_OSX_ARCHITECTURES</code>. </p>\n<p>There is not really anything against building a plugin in universal mode, it gets a little bigger, but then it can be used by an x86_64-only OpenCPN build (and presumably an arm64 version, but I haven't tackled OpenCPN builds yet.)</p>",
        "id": 350034676,
        "sender_full_name": "Kees Verruijt",
        "timestamp": 1681501693
    },
    {
        "content": "<p>Thanks nfo rthe PR. It's late here, but I'll try to find som time for it. This is most welcome, you are not the first running into this...</p>",
        "id": 350037637,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1681502883
    },
    {
        "content": "<blockquote>\n<p>I have prepared a release in v3.2. Can we talk before you push the button? In particular, don't forget to update Changelog...</p>\n</blockquote>\n<p>Away from my main pc from tomorrow for a week's shakedown sail. Will still have comms links.</p>",
        "id": 350099594,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1681541894
    },
    {
        "content": "<p>Given new activity on the PR, apparently there is some demand. First step is this PR which enables _developers_ to cross-build architectures. The main reason I needed this is that I have an M1 MacBookPro, so if I build the plugin _without_ this PR, I cannot test this on my Mac because the OpenCPN binary then uses a different architecture. E.g. I use it to build x86_64 on arm64! This is the exact problem that <span class=\"user-mention\" data-user-id=\"554731\">@Tony Voss</span> had as well.</p>",
        "id": 377810053,
        "sender_full_name": "Kees Verruijt",
        "timestamp": 1690112202
    },
    {
        "content": "<p>The next, separate, thing to consider is: Do we want to produce a native arm64 or universal version of OpenCPN in the next major release? And if so, how shall we handle plugins? Because suddenly we have to have those in either \"both\" architectures or in \"universal\" (=both in 1 package) style as well.<br>\nFor end-users, my opinion is that Universal is the easiest solution: they don't need to know or do anything, it just works (assuming that the plugins are all converted to Universal as well). It does make downloads bigger (by less than 2 because the non-binary parts don't repeat).<br>\nThe alternative would be to create a separate arm64 download for OpenCPN.</p>\n<p>Whatever we choose, I think we should already prepare ourselves on the plugin side, e.g. start creating plugins for both or universal, so that whenever O-next is released there are also plugins available for it.</p>",
        "id": 377814122,
        "sender_full_name": "Kees Verruijt",
        "timestamp": 1690113307
    },
    {
        "content": "<p>Note that there are no concerns regarding CI build infrastructure: you can easily create arm64 versions on x86_64 and vice-versa with Xcode. Or an \"universal\" (both architectures).</p>",
        "id": 377814703,
        "sender_full_name": "Kees Verruijt",
        "timestamp": 1690113450
    },
    {
        "content": "<p>With universal OCPN, presumably the Mac loader only loads the code version relative for the machine. <br>\nQuestion 1: can really mix plugins?  If on an arm machine, MacOS would load the arm OCPN code. I doubt you could then install an Intel plugin?  I might be wrong. <br>\nQuestion 2: if we build a universal plugin, would plugin manager meed to work out which plug-in code to load?</p>\n<p>Maybe MacOS is super smart here. But if not, looks like we need to build for both architectures and plugin manager then needs to know which to offer depending on which architecture it is running on.</p>",
        "id": 377820997,
        "sender_full_name": "Tony Voss",
        "timestamp": 1690115020
    },
    {
        "content": "<p>hm... late to the party. Also, I just don't know macos that well to say anything useful here.</p>\n<p>Just to clarify: When on macos, we are using the term  \"m1\" rather than \"arm\", right?</p>\n<p>I would really appreciate if we could get <span class=\"user-mention\" data-user-id=\"573239\">@Pavel Kalian</span>  into this loop. Ping?</p>",
        "id": 378188450,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1690213085
    },
    {
        "content": "<p>I highly doubt we can mix ARM and x86 code in a single process. I am still not sure whether we want to go with universal binaries (Which would imply providing all the dependencies ourselves) or build two single-arch packages (and being able to use dependencies from Homebrew). On a positive note I got myself an M1 machine, so will work on it. But not until I'm back from Europe in mid-August.</p>",
        "id": 378190181,
        "sender_full_name": "Pavel Kalian",
        "timestamp": 1690213404
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"399559\">@Mike Rossiter</span> Regarding updated 3.2 release with new targets (issue 547): I have pushed a fix to the v3.2 branch.  If you have time: could you test the build(s) available at <a href=\"https://cloudsmith.io/~alec-leamas/repos/opencpn-plugins-unstable/packages/\">https://cloudsmith.io/~alec-leamas/repos/opencpn-plugins-unstable/packages/</a> ? If they looks OK, please tag the branch using sd3.2.5-beta1 and push it as an update to the the beta catalog.</p>\n<p>If you don't have time, I can do it. But it will take some time, and I think Dave is eager to get a PR...</p>",
        "id": 383526736,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1691653886
    },
    {
        "content": "<blockquote>\n<p>If you have time</p>\n</blockquote>\n<p>On the case. I have time. I need this fix as well.</p>",
        "id": 383535615,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1691656029
    },
    {
        "content": "<p>Back ashore now and soon to pick up threads on the JavaScript plugin.  Presently build using SD3.2.5.  I am rather out of touch with developments.<br>\nIs there a recipe to build on Mac M2 targeting Mac Intel?  (Not trying to target M2 at this time.)<br>\nIf so, what do I have to twiddle to make that work?</p>",
        "id": 389922593,
        "sender_full_name": "Tony Voss",
        "timestamp": 1694194363
    }
]