[
    {
        "content": "<p>Tarball available here:<br>\n<a href=\"https://cloudsmith.io/~mike-rossiter/repos/aistx-alpha/packages/\">https://cloudsmith.io/~mike-rossiter/repos/aistx-alpha/packages/</a></p>",
        "id": 306416085,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1666865838
    },
    {
        "content": "<p>Fabian ... <br>\nYou may need to check how the checksum is made. IEC 61162-1 refers. Your test app includes \"!\" and \"*\".</p>",
        "id": 306416928,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1666866127
    },
    {
        "content": "<p>Ahh, yea. the ! and * are indeed part of the string used in the function. but that is why i made the for loop start at 1 and end at str.length() - 2. so they are apart of the string but not the calculation.</p>",
        "id": 306422965,
        "sender_full_name": "Fabian Olsthoorn",
        "timestamp": 1666868593
    },
    {
        "content": "<p>Somehow we seem to end up with a different checksum to the one you showed as the output of the test app. May need to wait until you can run the output of the plugin to the transceiver.</p>",
        "id": 306423526,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1666868829
    },
    {
        "content": "<p>Hmm, that is strange. For me the checksum that my code made hasn't been a problem while sending over the transceiver. The one it generates works and if i change it in any way at all the transceiver doesn't want to send it anymore.</p>",
        "id": 306424188,
        "sender_full_name": "Fabian Olsthoorn",
        "timestamp": 1666869094
    },
    {
        "content": "<p>I will take another look at my code.</p>",
        "id": 306424637,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1666869297
    },
    {
        "content": "<p>I am trying to add my serial connection code to the project. so I just copy pasted it into the src folder, but when i try to run the batch file it says it doesn't excist. Do you know how to fix this error? In VS you can just add a source path, but I'm not sure how to do that here. I've tried adding them in the CMakeList, but that didn't work.</p>",
        "id": 306426745,
        "sender_full_name": "Fabian Olsthoorn",
        "timestamp": 1666870119
    },
    {
        "content": "<p>Did you add the files to <em>CMakeLists.txt</em>? And added stuff to the header file using this code.</p>",
        "id": 306429505,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1666871185
    },
    {
        "content": "<p>Oh, you need to delete the build folder each time you run the batch file. Maybe take a backup first!</p>",
        "id": 306429683,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1666871261
    },
    {
        "content": "<p>Yes, i added them to the CmakeLists.txt under set(SRC) and tried deleting the build folder first. What do you mean with adding stuff to the header file?</p>",
        "id": 306430362,
        "sender_full_name": "Fabian Olsthoorn",
        "timestamp": 1666871510
    },
    {
        "content": "<p>I am confusing things. You can make a connection in OpenCPN, choosing the serial port you want to send on. No need to code for serial output.</p>",
        "id": 306431577,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1666871917
    },
    {
        "content": "<p>Ohh, alright. so if i just make an output connection over the correct COM port, does your code just send it through there automatically?</p>",
        "id": 306432664,
        "sender_full_name": "Fabian Olsthoorn",
        "timestamp": 1666872254
    },
    {
        "content": "<p>The timer triggers the Notify() function in <em>aisTXgui_impl.cpp</em>.  You will see  a push message. This sends the string for transmission. Off for lunch.</p>",
        "id": 306433137,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1666872402
    },
    {
        "content": "<p>Fixed the checksum issue using your code. Now in the latest commit.</p>",
        "id": 306433287,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1666872450
    },
    {
        "content": "<p>Nice</p>",
        "id": 306433569,
        "sender_full_name": "Fabian Olsthoorn",
        "timestamp": 1666872522
    },
    {
        "content": "<p>Eyy, it works! The tranciever is able to send the messages which you can then see in OpenCPN. Only the checksum in the AIVDM message bar doesn't allign with what OpenCPN is recieving.</p>",
        "id": 306439738,
        "sender_full_name": "Fabian Olsthoorn",
        "timestamp": 1666874457
    },
    {
        "content": "<p>Latest commit corrects this!</p>",
        "id": 306439882,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1666874512
    },
    {
        "content": "<p>I am going to tidy up aisRX_pi. There will then be no need to copy/paste what comes out of the transmission into the textbox. Intend keeping just Text and Water Depth FI.</p>",
        "id": 306441827,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1666875127
    },
    {
        "content": "<p>So, then the input wil automatically be decoded?</p>",
        "id": 306442070,
        "sender_full_name": "Fabian Olsthoorn",
        "timestamp": 1666875220
    },
    {
        "content": "<p>Correct.</p>",
        "id": 306442217,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1666875263
    },
    {
        "content": "<p>Alright, sounds good. I will have a progress meeting with one of my teachers on monday. I have to make a presentation for that and finnish writing some documents. So I'll not be able to do much coding  and testing anymore untill after that.</p>",
        "id": 306443098,
        "sender_full_name": "Fabian Olsthoorn",
        "timestamp": 1666875557
    },
    {
        "content": "<p>Understood.</p>",
        "id": 306443341,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1666875623
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"559084\">@Fabian Olsthoorn</span>  Need to upgrade the ShipDriver template to get a lot of the Linux builds working. Windows is ok. Will leave this until I have aisRX_pi in a better state.</p>",
        "id": 306460648,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1666880570
    },
    {
        "content": "<p>Hope the presentation went well.<br>\nDoes the spec call for the same transceiver being able to transmit Text messages for several features? Previously I did look at this for FI  41.</p>",
        "id": 307282896,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1667298758
    },
    {
        "content": "<p>Presentation went well. The only worry they had is that the code in the plug-in is mostly writen by you at the moment. My university wants to see a product that I made. Ofcourse getting help is fine, but I have to be warry that it doesn't end up as someone else's product.</p>\n<p>Yes, the text messages are going to be used for mutiple features from one single base station. For example, a bridge being open or a message that tells us a storm might be comming.</p>",
        "id": 307289942,
        "sender_full_name": "Fabian Olsthoorn",
        "timestamp": 1667301602
    },
    {
        "content": "<blockquote>\n<p>My university wants to see a product that I made. </p>\n</blockquote>\n<p>Understand their concerns.</p>",
        "id": 307296866,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1667304402
    },
    {
        "content": "<p>Me too, but I'm not too worried. Because what we have right now is basically  the PoC already done, and I still have 10 weeks of internship remaining. I feel like the only thing I don't fully understand is the implementation into OpenCPN. So, I have a lot of time left to look into that.</p>",
        "id": 307300704,
        "sender_full_name": "Fabian Olsthoorn",
        "timestamp": 1667305851
    },
    {
        "content": "<p>Good. <br>\nThere are two competing workflows for getting a plugin into the catalog. One is  the <em>Testplugin</em> template and the other is <em>Shipdriver. Shipdriver</em> is the one I use, based on my plugin and vastly enhanced by Alec Leamas with a ton of additions.<br>\nHere is good documentation for the <em>Shipdriver</em> template:<br>\n<a href=\"https://opencpn-manuals.github.io/main/AlternativeWorkflow/index.html\">https://opencpn-manuals.github.io/main/AlternativeWorkflow/index.html</a><br>\nFor me the actions after the PR with the plugin details are made for <em>OpenCPN/plugins</em> are a black box.  If the PR is accepted the plugin appears in the catalog.<br>\nInterested to hear your ideas for multiple text messages. I have played with xml but a database could also be used.</p>",
        "id": 307315574,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1667310751
    },
    {
        "content": "<p>Thank you, I will take a look at the documentation and play around with Shipdriver some more. As for the multiple text messages, I think we can just keep using the text input so that the operators can just write whatever is needed.</p>",
        "id": 307682819,
        "sender_full_name": "Fabian Olsthoorn",
        "timestamp": 1667466506
    },
    {
        "content": "<blockquote>\n<p>just keep using the text input so that the operators can just write whatever is needed.</p>\n</blockquote>\n<p>Probably my lack of understanding but if a message is changed won't the transceiver stop sending the previous message? I am close to having aisTX_multi ready for a test. This saves messages as XML.  Individual messages can be edited, deleted etc.</p>",
        "id": 307692892,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1667470401
    },
    {
        "content": "<p>The payload(So the text in the message) can change, but the package around the payload cannot change as easly. So if we have !xxBBM,1,1,0,1,8,&lt;Rh76039hmkqo08F2BE7P?@5&gt;,0*4D</p>\n<p>!xxBBM: There might be some other prefix that works, but this is the only one I found so far<br>\n1,1,0: Depends on if the full message needs mutiple messages to fit<br>\n1: Is the radio channel A or B. 1 for A, 2 for B<br>\n8: Is the message type. So can be 6 too for example, but then we'd have to add a destination MMSI to the payload.<br>\nThen for the payload I use <a href=\"https://www.e-navigation.nl/content/isrs-text-message\">https://www.e-navigation.nl/content/isrs-text-message</a> for this. And then only the binary data part is the payload.<br>\nAnd lastly the fillbit and checksum which always change.</p>\n<p>But I think that having some messages pre-saved if standard input would be nice for the operators ease of use. </p>\n<p>I just had a meeting with my supervisor and he told me that we're not suppose to have the transmitting side online on github. I told him what we have right now is public knowlage so there is nothing in the plug-in that is on Git to worry about. But he said we're not supposed to add to the plug-in. It should be only available for our oparators so that not anyone can just send these message and spread miss information.</p>",
        "id": 307703242,
        "sender_full_name": "Fabian Olsthoorn",
        "timestamp": 1667473921
    },
    {
        "content": "<p>Understand the issue of security. As a first step I have made the github Tx repos private. Tarballs can still be made offline. As you say all the references are in the public domain. The MMSI is linked to the transceiver. Spoofing is possible but the rogue MMSI could be identified??? Voice VHF would have the same issues with even more problems of tracing the operator. Need to get some advice on this.</p>",
        "id": 307713371,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1667477424
    },
    {
        "content": "<p>Hmm, that's a good point about being able to identify the MMSI. Might be too much work, but it could be interesting to whitelist all the offcial base stations so that the plug-in ignores any other MMSIs.</p>",
        "id": 307717830,
        "sender_full_name": "Fabian Olsthoorn",
        "timestamp": 1667478782
    },
    {
        "content": "<p>For the plug-in release, atleast on th Tx side I was thinking it might be easier if the operators just download the plug-in from our government department's Git and then just import the tarball like how I am doing it at the moment. the Rx side shoulde be widely available for everyone.</p>",
        "id": 307718520,
        "sender_full_name": "Fabian Olsthoorn",
        "timestamp": 1667478984
    },
    {
        "content": "<p>Also, when the pin gets made in OpenCPN when you click on the list in Rx. Does the location of this pin automatically change if you give it a different input, or is it hard coded to appear in the proper spot right now?</p>",
        "id": 307718725,
        "sender_full_name": "Fabian Olsthoorn",
        "timestamp": 1667479061
    },
    {
        "content": "<blockquote>\n<p>Does the location of this pin automatically change</p>\n</blockquote>\n<p>Yes ... it gets the lat/lon from the RIS Index.</p>",
        "id": 307719133,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1667479184
    },
    {
        "content": "<p>I tried make a tarball with the motubuilder project you send, but I get two errors. One is when I use the \"cmake -G \"Visual Studio 15 2017\" ..\" command. It tells me it does not match the generator used previously: Visual Studio 16 2019. But when I generate a tarball with aisTX_pi this error also appears, but the tarball generates just fine. So, I don't think it matters.</p>\n<p>The other error is when I use \"cmake --build . --target tarball --config Release\". Which tells me it's an MSBuild error MSB1009: project file does not exist. When I try to use shipdriver_pi I get this same error, but not with aisTX_pi.</p>\n<p>I think the problem might be in CMakeLists.txt. Because when I use \"cmake -A Win32 ..\" it generates a lot less files in the build folder than when I use it in aisTX_pi. But I'm not sure if this is the case and what I could do to fix this. Do you have any ideas?</p>",
        "id": 308552057,
        "sender_full_name": "Fabian Olsthoorn",
        "timestamp": 1667901733
    },
    {
        "content": "<p>My confusing things. motubuilder was intended as a template for a standalone app. It generates a solution file for working with VS. Functions from the plugin could be added.<br>\nI have sent a new package to your <a href=\"http://RWS.nl\">RWS.nl</a> account which should explain things. Hope the batch file gets through. This does not work with OpenCPN tarballs. It is standalone.<br>\nBut ... may not be worth working on if RWS can accept a public OpenCPN plugin.</p>",
        "id": 308561349,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1667905373
    },
    {
        "content": "<p>The next builds of OpenCPN will use VS2019. My stuff is moving to 2019 hence the strange notices etc. Also there will be a move to wxWidgets 3.2.1. This change in ABI will mean all plugins needing to be rebuilt! Yuk!</p>",
        "id": 308563057,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1667906007
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"399559\">Mike Rossiter</span> <a href=\"#narrow/stream/352080-aisTX_pi/topic/general/near/308563057\">said</a>:</p>\n<blockquote>\n<p>The next builds of OpenCPN will use VS2019. My stuff is moving to 2019 hence the strange notices etc. Also there will be a move to wxWidgets 3.2.1. This change in ABI will mean all plugins needing to be rebuilt! Yuk!</p>\n</blockquote>\n<p>Haha, hopefully this will happen after my internship.</p>",
        "id": 308566198,
        "sender_full_name": "Fabian Olsthoorn",
        "timestamp": 1667907304
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"399559\">Mike Rossiter</span> <a href=\"#narrow/stream/352080-aisTX_pi/topic/general/near/308561349\">said</a>:</p>\n<blockquote>\n<p>I have sent a new package to your <a href=\"http://RWS.nl\">RWS.nl</a> account which should explain things. Hope the batch file gets through.</p>\n</blockquote>\n<p>Yes, it works.</p>",
        "id": 308576000,
        "sender_full_name": "Fabian Olsthoorn",
        "timestamp": 1667911223
    },
    {
        "content": "<p>Repo with a standalone aisTX_app:<br>\n<a href=\"https://github.com/Rasbats/aisTX_app/releases/tag/v0.1-alpha\">https://github.com/Rasbats/aisTX_app/releases/tag/v0.1-alpha</a><br>\nDefault is to make an !AIVDM.<br>\nCan be modified to send a BBM using your code in <em>encoder.h</em>.</p>",
        "id": 310431580,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1668611539
    },
    {
        "content": "<p>It took some time, but the client has decided that he does not want the code to be online. One of my colleagues said he would talk about what to do with someone at OpenCPN. </p>\n<p>Another issue that we have was that the ISRS code that works in OpenCPN does not work on other programs. The reason seems to be that the ISRS codes in OpenCPN are outdated. Since the one we use now is from a list made in 2019 and the ISRS code that works in other programs is from a list made in 2022. The ISRS code that works in other programs does not work in OpenCPN either.</p>",
        "id": 312597251,
        "sender_full_name": "Fabian Olsthoorn",
        "timestamp": 1669631843
    },
    {
        "content": "<blockquote>\n<p>the client has decided that he does not want the code to be online</p>\n</blockquote>\n<p>It seems to me that the simplest way for TX is a standalone app. Easy .. the basic work has been done, both by your app and mine.</p>\n<blockquote>\n<p>the ISRS code that works in OpenCPN does not work on other programs</p>\n</blockquote>\n<p>This is because I am using a database that I made some time ago. Easily updated, if I can remember where it came from! It is not part of the main OpenCPN program only my RX plugin.</p>",
        "id": 312600789,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1669633033
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"399559\">Mike Rossiter</span> <a href=\"#narrow/stream/352080-aisTX_pi/topic/general/near/312600789\">said</a>:</p>\n<blockquote>\n<p>It seems to me that the simplest way for TX is a standalone app. Easy .. the basic work has been done, both by your app and mine.</p>\n</blockquote>\n<p>Yes, I wanted a standalone app from the beginning. Just seemed easier since it didn't need any OpenCPN functionalities anyways. But that was declined back then.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"399559\">Mike Rossiter</span> <a href=\"#narrow/stream/352080-aisTX_pi/topic/general/near/312600789\">said</a>:</p>\n<blockquote>\n<p>This is because I am using a database that I made some time ago. Easily updated, if I can remember where it came from! It is not part of the main OpenCPN program only my RX plugin.</p>\n</blockquote>\n<p>Ahh, I see. Not sure how this works exactly, but if it helps you can download an updated excel file on this website: <a href=\"https://www.vaarweginformatie.nl/frp/main/#/page/downloads\">https://www.vaarweginformatie.nl/frp/main/#/page/downloads</a></p>",
        "id": 312602274,
        "sender_full_name": "Fabian Olsthoorn",
        "timestamp": 1669633471
    },
    {
        "content": "<blockquote>\n<p>you can download an updated excel file</p>\n</blockquote>\n<p>Yes ... but this is only NL. Is there an EU wide index?</p>",
        "id": 312603934,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1669634038
    },
    {
        "content": "<p>Jeffrey advised that the BICS program had the best updated version.  I don't know how to access that.</p>",
        "id": 312604625,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1669634287
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"399559\">Mike Rossiter</span> <a href=\"#narrow/stream/352080-aisTX_pi/topic/general/near/312603934\">said</a>:</p>\n<blockquote>\n<p>Yes ... but this is only NL. Is there an EU wide index?</p>\n</blockquote>\n<p>Ohh, my bad. I thought it was for EU. This is the only one I could find. I also haven't heard of the BICS program either.</p>",
        "id": 312605698,
        "sender_full_name": "Fabian Olsthoorn",
        "timestamp": 1669634680
    },
    {
        "content": "<p>This seems to be where I downloaded before. But ... the server is down at the moment!</p>\n<p><a href=\"https://webgate.ec.europa.eu/RIS/EUERDMS_WEB\"> https://webgate.ec.europa.eu/RIS/EUERDMS_WEB</a></p>",
        "id": 312612048,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1669637002
    },
    {
        "content": "<p>Ok ... I can get a dump from here. But what should I use for the earliest date? Afraid there might be duplicates if I use too early a date.</p>\n<p><a href=\"https://nlrdms.rws.nl/reftoolclient/masterdump/\">https://nlrdms.rws.nl/reftoolclient/masterdump/</a></p>",
        "id": 312688453,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1669658562
    },
    {
        "content": "<p>Answered my own question ... if not erased it must be active? Can eliminate duplicates by SQL 'Distinct'.</p>",
        "id": 312691135,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1669659360
    },
    {
        "content": "<p>ISRS has dropped the Fairway Section number but the ISRS Text Message FI 44 still has this parameter:<br>\n<a href=\"https://www.e-navigation.nl/content/isrs-text-message\">https://www.e-navigation.nl/content/isrs-text-message</a><br>\nIs FI 44 going to be updated?</p>",
        "id": 312817024,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1669719940
    },
    {
        "content": "<blockquote>\n<p>Is FI 44 going to be updated?</p>\n</blockquote>\n<p>No ... wwsectcode is the same as previous Fairway Section. But the objcode has changed for our LEIDSCHENDAM sample???</p>",
        "id": 312819380,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1669720763
    },
    {
        "content": "<p>No time today. I need to use the new db I have made and see what is going on.</p>",
        "id": 312822955,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1669722111
    },
    {
        "content": "<p>Latest post on aisRX_pi has the recent database. LEIDSCHENDAM has objcode changed from <em>5397</em> to <em>5398</em>, I think.</p>",
        "id": 313938862,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1670238560
    }
]