[
    {
        "content": "<p><a href=\"https://bazel.build/basics/hermeticity\">https://bazel.build/basics/hermeticity</a></p>",
        "id": 565045653,
        "sender_full_name": "Quinton Hoole",
        "timestamp": 1766424887
    },
    {
        "content": "<p>I tried out Windows containers on Windows yesterday and they didn’t work on my pretty standard Lenovo Windows laptop. I followed the Docker and Microsoft instructions, was prompted to enable Hyper-V, which took a long time me and then failed without an explanation. It’s possibly because I’m not running a “Professional” or “Enterprise” version of Windows. Anyhow, in theory it seems very useful, but in practise I didn’t work. Maybe <span class=\"user-mention\" data-user-id=\"522729\">@Dan Dickey</span> our windows boffin can give it a try. Unfortunately it doesn’t sound useful for our use case. <br>\n<a href=\"https://learn.microsoft.com/en-us/virtualization/windowscontainers/about/\">https://learn.microsoft.com/en-us/virtualization/windowscontainers/about/</a></p>\n<p>I also tried MacOS containers on MacOS. Unfortunately those are only supported on the upcoming MacOS 26, which is available in beta, but I shied away from that. Interesting project though, and open source. <a href=\"https://github.com/apple/container\">https://github.com/apple/container</a>. </p>\n<p>Linux containers ran just fine on Linux,  Windows  and MacOS though, using Docker. Probably not super useful though, as Alec suggested above. So I conclude that we’re probably stuck with local, non-containerized builds, unfortunately.</p>",
        "id": 565189496,
        "sender_full_name": "Quinton Hoole",
        "timestamp": 1766510147
    },
    {
        "content": "<blockquote>\n<p>It's as if no one realizes that for Windows we have a local build script that does all the gathering of dependencies and sets up the entire build</p>\n</blockquote>\n<p>At least I am aware of this, and it's indeed a nice script.</p>\n<p>However, it's for building the core OpenCPN. The subject here is to build a basic \"hello  world\" plugin, a different use case.</p>\n<p>Although this could be discussed I <strong>think</strong> that for Windows we want to avoid building both OpenCPN and wxWidgets and use pre compiled binaries  for the basic demo build. </p>\n<p>That said, we definitely need something similar as for OpenCPN in a next step: Rebuilding opencpn + it's deps and setup VS so there is a more realistic plugin development environment.  Probably best avoided for \"hello world\", though.</p>",
        "id": 565260678,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1766567312
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"399510\">Alec Leamas</span> <a href=\"#narrow/channel/332168-Master/topic//near/565260678\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>However, it's for building the core OpenCPN. The subject here is to build a basic \"hello world\" plugin, a different use case.</p>\n</blockquote>\n</blockquote>\n<p>Yes, and it demonstrates that having an isolated build environment in Windows is possible, desirable even. It would not be complicated for plugin developers to set up plugin repositories alongside OpenCPN. A local Windows folder structure could look like this:</p>\n<p>\\user\\xxxyyy\\source\\repos\\OpenCPN\\ocpn_wxWidgets<br>\n\\user\\xxxyyy\\source\\repos\\OpenCPN\\OpenCPN<br>\n\\user\\xxxyyy\\source\\repos\\OpenCPN\\HelloWorld_pi<br>\n:<br>\n:<br>\n\\user\\xxxyyy\\source\\repos\\OpenCPN\\MyAwesomePlugin_pi</p>\n<p>The plugin dependencies from OpenCPN and wxWidgets are ready at hand and always compatible. Other plugin dependencies could be kept within the plugin folder itself.</p>\n<p>The reason for building wxWidgets from sources is to get binaries that wxWidgets does not provide such as full debug info and RelWithDebInfo binaries.  We would never want to \"ship\" a plugin built anywhere except in a controlled CI build environment for obvious reasons. However, local building with debuggable binaries can be a huge help to developers familiar with the VS IDE. The ability to step from O into a plugin into wxWidgets and back seamlessly with full source code debug info can be a huge benefit. Plus, VS offers a lot of tools for multi-threaded analysis and debugging. This all works so much better if you have the full wxWidgets sources and dependencies located locally because VS gets info from the sources to improve code completion and AI help.</p>\n<p>I think all plugin dependencies can be automatically installed locally via script(s) just as we do now with things like NSIS, GetText, et. al.</p>\n<p>Debugging is seamless. The plugin developer starts O from VS debugger. Breakpoints can be set in plugin source code. As soon as the plugin dll is loaded by OpenCPN the breakpoints will automatically activate. Today, OpenCPN will happily load any config type of plugin dll (release, debug, etc.) and you have the full suite of tools within VS available for both O and plugin source code.</p>",
        "id": 565292297,
        "sender_full_name": "Dan Dickey",
        "timestamp": 1766588545
    }
]