[
    {
        "content": "<p>I need some help. The core issue is that my Clipper NMEA repeater seemingly is not happy with  the RMB data generated by opencpn.  The overall connection is fine, the position works. But not SOG, XTE, etc.</p>\n<p>Looking at the RMB messages opencpn generates they look like this:</p>\n<div class=\"codehilite\"><pre><span></span><code>$ECRMB, A, 0.000, L, Begin, 005, 6527.552, N, 02235.795, E, 0.373, 271.336, 0.000, V, A*04\n$ECRMB, A, 0.000, L, Begin, 005, 6527.552, N, 02235.795, E, 12.926, 118.465, -0.000, V, A*1D&lt;0D&gt;&lt;0A&gt;\n</code></pre></div>\n<p>My question is about the last part of that message: <code>0.000, V, A*04</code>  . Here 0.000 is the speed to waypoint, 0 since  I'm currently in harbour.  After this there is <code>V, A</code> and a checksum.</p>\n<p>However, when I look at the specs such as they are I only find one part, the arrival flag . It should at least be 'A' if n the arrival circle is entered. Some sources says it should be 'V' if not.</p>\n<p>But opencpn sends two fields: 'A', 'V'. Something is broken here:  me, specs or opencpn. </p>\n<p>Any hint out there?<br>\n<span class=\"user-mention\" data-user-id=\"522486\">@Håkan Svensson</span></p>",
        "id": 526364160,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1751277784
    },
    {
        "content": "<p>ok, found it: It's the NMEA 2.3  FAA Mode inidicator.   Ergo: my specs was wrong</p>",
        "id": 526370092,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1751279857
    },
    {
        "content": "<p>Yes, OCPN understands both with and without the FAA mode while receiving RMB but transmit according to NMEA v. &gt;= 2.3 i.e including FFA mode.</p>",
        "id": 526371923,
        "sender_full_name": "Håkan Svensson",
        "timestamp": 1751280495
    },
    {
        "content": "<p>This is about what it sends. But I think was on wrong track here. The clipper toggles between a correct view and a \"no rmbd\" message, it's like blinking. </p>\n<p>Initially its ok, it takes a \"while\" before the blinking starts. Does it want something else than RMC and RMB?</p>",
        "id": 526372935,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1751280843
    },
    {
        "content": "<p>It seems like it's an instrument to show data when navigation to a WP?<br>\nSo you may need to follow an active track and filter the NMEA output port to the instrument to only transmit \"EC\". That will include OCPN's own RMC and RMB. And not the one created by a GNSS receiver as when you output \"all\".</p>",
        "id": 526374524,
        "sender_full_name": "Håkan Svensson",
        "timestamp": 1751281438
    },
    {
        "content": "<p>Yup, fixed it. I owe you a beer!</p>",
        "id": 526375299,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1751281704
    }
]