[
    {
        "content": "<p>Please see <br>\n<a href=\"https://github.com/i-net-software/dokuwiki-plugin-siteexport/issues/131\">https://github.com/i-net-software/dokuwiki-plugin-siteexport/issues/131</a><br>\n<a href=\"https://forum.dokuwiki.org/d/22292-xampp-dokuwiki-installation\">https://forum.dokuwiki.org/d/22292-xampp-dokuwiki-installation</a><br>\nI am convinced siteexport will complete fully, once I can configure a local apache+dokuwiki+opencpn-data that will allow siteexport to complete without the result  \"Finished but download failed.\"   The server version uses the correct TOC and namespaces but fails on timeout.<br>\nMany thanks to all the Editors who have done a wonderful polished up job on the manual!</p>",
        "id": 443651889,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1717973246
    },
    {
        "content": "<p>Also this shows the siteexport configuration needed.<br>\n<a href=\"https://github.com/samuelet/indexmenu/issues/314\">https://github.com/samuelet/indexmenu/issues/314</a></p>",
        "id": 443656135,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1717975514
    },
    {
        "content": "<p>I am going to disable Editors (managers) being able to edit the wiki manual for awhile.  SiteExport may be timed out by Editors changing  pages.</p>",
        "id": 443781442,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1718028936
    },
    {
        "content": "<p>I've given up. Go ahead and edit. Thanks.</p>",
        "id": 443849807,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1718048445
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"517002\">@Dave Register</span> <span class=\"user-mention\" data-user-id=\"399510\">@Alec Leamas</span> <br>\nI pulled today's Git with \"updated User Documentation\"<br>\nI run win_dep.bat on \"my branch\" and want to commit the changes.  I get a lot of these:<br>\n<code>data/doc/lib/plugins/ckgedit/scripts/mediamgr.js:38: trailing whitespace.</code><br>\nQ1: Any trick to clean out or ignore whitespace after add . and before commit.<br>\nQ2 Would we ignore the git whitespace rule for \"data/doc\"</p>",
        "id": 451744246,
        "sender_full_name": "Håkan Svensson",
        "timestamp": 1721131568
    },
    {
        "content": "<p>On phone, sailing. It should just be to remove the offending whitespace and then make a PR. Most editors has functions for this. För Linux cli solution Google \"see remove trailing whitespace.</p>\n<p>Or just wait until Thursday when I'm ashore and can fix it</p>",
        "id": 451745708,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1721132144
    },
    {
        "content": "<p>I e \"sed remove trailing whitespace\". Damned phone.</p>",
        "id": 451745910,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1721132230
    },
    {
        "content": "<p>Thanks, but I was to quick. (As usual?)<br>\nThese doc files are not tracked so I should not commit.<br>\nFor tracked files I added to git config: <br>\napply.whitespace=fix</p>\n<p>Now to get rid of \"all\" un-tracked status view I added:<br>\nstatus.showuntrackedfiles=no<br>\nIf I'm correct the: <code>git commit -a -m \"message\"</code> will not include untracked files.  (Will be obvious by next commit :))</p>",
        "id": 451752719,
        "sender_full_name": "Håkan Svensson",
        "timestamp": 1721134701
    },
    {
        "content": "<p>Hakan, this is error is coming from ckgedit I think, which is a plugin for Dokuwiki. It may be occuring because Dave and I are trying to include the dokuwiki \"Quick Start Guide\" (12mb)  as a test for \"Help\".  Dave decided to implement it and I don't know about the programming mechanics.  Right now I am checking how well Help works (pretty good) but there are few dead ends and improvements needed.  I expect Dave will have more valuable info.  He sent me a full build from his repo maybe you can get that. Or I can provide the link.</p>",
        "id": 451753550,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1721134930
    },
    {
        "content": "<p><a href=\"https://dl.cloudsmith.io/public/david-register/opencpn-unstable/raw/files/opencpn_5.9.0-0+1752.69b8b0b_setup.exe\">https://dl.cloudsmith.io/public/david-register/opencpn-unstable/raw/files/opencpn_5.9.0-0+1752.69b8b0b_setup.exe</a></p>",
        "id": 451754373,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1721135118
    },
    {
        "content": "<p>I don't think white spaces in documents like this would be seen as a trouble.<br>\nMy note was about Git's handling where the mistake was mine. So no further issue with this. Thanks</p>",
        "id": 451754687,
        "sender_full_name": "Håkan Svensson",
        "timestamp": 1721135207
    },
    {
        "content": "<p>Note that the html files created by dokuwiki are not possible to include in Linux packages since they are not open source. Perhaps they could be made available as a separate download or a plugin</p>",
        "id": 451771511,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1721140119
    },
    {
        "content": "<blockquote>\n<p>white space in documents would be seen as a trouble </p>\n</blockquote>\n<p>It is a problem which will be flagged by packaging toolchains. However, downstream will create patches as required.</p>",
        "id": 451772224,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1721140351
    },
    {
        "content": "<p>I don't know about this Alec, but Dokuwiki is an opensource program and the content is for an opensource program. Sounds open source to me.  ...and Isn't html opensource?  Anyway, why should we care?  What is the real problem?   Support by debian or something?</p>",
        "id": 451776330,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1721141445
    },
    {
        "content": "<p>Problem: the html cannot be generated as part of the build process.  This means they are not open source,.</p>\n<p>The practical consequences are that these files cannot be included in Debian/Ubuntu packages.</p>",
        "id": 451778878,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1721142087
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"517002\">@Dave Register</span> </p>\n<p>Ok, I see. I thought that might be the issue.  Why don't these systems allow a chunk of files to be included?  In real life they are  .TXT files that are run by apache server and php,  which is all opensource.</p>\n<p>What should we be doing?  Including a small dokuwiki apache setup that actually runs the wiki?</p>",
        "id": 451784943,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1721143359
    },
    {
        "content": "<p>On the other hand,  use of html is the best way to reduce the file size without the overhead of dokuwiki engine.  Is there some format that is accepted?  epub, pdf, txt etc.?</p>",
        "id": 451785863,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1721143520
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"517002\">@Dave Register</span> <br>\nMaybe when OpenCPN is first installed, it should contain a download link in the \"Help\" and as part of the \"Initial Configuration\" <a href=\"https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:quick_start_guide:initial_configuration\">https://opencpn.org/wiki/dokuwiki/doku.php?id=opencpn:manual_basic:quick_start_guide:initial_configuration</a>  We should add an optional step to Download the \"Help\" files.  This would then populate the help area with html so that those files are never a part of the compile process.</p>\n<p>Then of course we want the user to be able to \"Update\" the \"Help\" file as the help manual is edited and updated.</p>",
        "id": 451787766,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1721143844
    },
    {
        "content": "<p>We could certainly come up with a more comprehensive solution for help and doc files.<br>\nBut not for O5.10.  This thing is very near launch, now.  Keep the focus...</p>\n<p>So,on O5.10  we will do what O584 does. <br>\n1 Bundle docs on Windows and MacOS.<br>\n2 On linux, refer user to <a href=\"http://opencpn.org\">opencpn.org</a> page to access/download manuals.</p>",
        "id": 451836500,
        "sender_full_name": "Dave Register",
        "timestamp": 1721156141
    },
    {
        "content": "<p>Maybe we include Quick Start documentation and have a download option for the rest.</p>",
        "id": 452340207,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1721308230
    },
    {
        "content": "<p>Now the inbound wiki is nicely working on Win.<br>\nThere are though not so few not working links. For example:<br>\nTOOLBAR - Set Options -- non of the sub menus there are working<br>\nManage route and marks -- non of the sub menus there are working<br>\nCHART PANEL -- non of the sub or sub/sub menus there are working</p>\n<p>To include these the size of the installation file will grow. That's clear.<br>\nMy humble reflection: <br>\nNow the Win opencpn.exe is about 70 Mb. If it grows to, say, 80 Mb it wouldn't be harmful these days, would it?</p>",
        "id": 452869719,
        "sender_full_name": "Håkan Svensson",
        "timestamp": 1721497580
    },
    {
        "content": "<p>At some point later,  a download link to complete the entire manual, stating the full size.</p>",
        "id": 452906675,
        "sender_full_name": "Rick Gleason",
        "timestamp": 1721513823
    }
]