[
    {
        "content": "<p>SVG files can contain text to be rendered into glyphs.  In the case of the {JS} SVGs for JavaScript_pi v2.0.2, they are very complicated and do contain the characters { S V and { again.  The last is presumably to be mirrored to }.  They are to be rendered in Arial font.  I guess the issue is that that this is no longer working.<br>\nThe SVG I sent you has only vectors.  I will have a go at generating glyph-only SVGs later today.</p>",
        "id": 338274621,
        "sender_full_name": "Tony Voss",
        "timestamp": 1677489954
    },
    {
        "content": "<p>With large size icons (700 pixels) I imported a png with text. Using inkscape I used \"tracebitmap\" to convert the text to a path. Removed the bitmap. The attached work with Windows.<br>\nIf there are concerns about the icon for the plugins panel being png this could also be converted to svg.<br>\n<a href=\"/user_uploads/33951/2qzRsBZNbyjsn5h1YueoxsNX/icon.data.zip\">icon.data.zip</a></p>",
        "id": 338299370,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1677496707
    },
    {
        "content": "<p>Tests were done with a fork made this morning of your branch <em>v2.0.2-wx3.2</em>.</p>",
        "id": 338300255,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1677496952
    },
    {
        "content": "<p>So no need for your work to remove the SVG stuff?</p>",
        "id": 338303275,
        "sender_full_name": "Tony Voss",
        "timestamp": 1677497811
    },
    {
        "content": "<p>Correct!</p>",
        "id": 338303359,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1677497841
    },
    {
        "content": "<p><strong>Toolbar icon oddity</strong><br>\nOn two OCPN5.7 Beta 4 installations, the toolbar icons behave differently.<br>\nI have copied the <code>libJavaScript_pi.dylib</code> and the data folder containing the icons across from one to the other, so I am <em>certain</em> I am running exactly the same versions.</p>\n<p>On MacOS Ventura on both ARM and Intel systems, the toolbar icons are correct.<br>\nOn an earlier MacOS Catalina, the untoggled JS icon is entirely black and the letters undecernable.  The toggled icon is correct with the  white letters on a grey background.<br>\nHunch:  might the letters on the untoggled icon be relying on a default colour rather than being explicitly set white?</p>",
        "id": 339058078,
        "sender_full_name": "Tony Voss",
        "timestamp": 1677752994
    }
]