[
    {
        "content": "<p>Alec and I have had a discussion on the desirability of  using wxSTAY_ON_TOP.<br>\nHe suggests there is no need for it on Windows and he, personally, does not like it on MacOS whereas I do.<br>\nIn the latest builds of v2.1 in my alpha repository (after 14:47 today 4th April) there is an option in the Tools Console tab to turn it on or off.</p>\n<p>Mike - can you give it a try on Windows and let me know what effect it has and whether it is worth keeping as an option on Windows?</p>",
        "id": 346855080,
        "sender_full_name": "Tony Voss",
        "timestamp": 1680615586
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"399559\">@Mike Rossiter</span> ^</p>",
        "id": 346936828,
        "sender_full_name": "Alec Leamas",
        "timestamp": 1680632167
    },
    {
        "content": "<p>Windows: With \"Keep consoles on top\" it makes it difficult to navigate between consoles. You need to move the top console off the bottom one or click in the header of the console in order to use that console.  With multiple consoles this could be a problem.</p>",
        "id": 347089167,
        "sender_full_name": "Mike Rossiter",
        "timestamp": 1680689822
    },
    {
        "content": "<p>I have now converted the JavaScript plugin to use wxFrame instead of wxDialog.  It can now use wxFLOAT_ON_PARENT.  Given different views on whether keeping consoles on top is dsirable, I have added a user option to choose whether or not to use wxFLOAT_ON_PARENT.<br>\nThe change-over was much easier than I had anticipated.</p>\n<ol>\n<li>In wxFormBuilder add a new wxFrame and move it to the top of the window list.</li>\n<li>Drag the top sizer from wxDialog to the new wxFrame.</li>\n<li>Delete the now empty wxDialog and rename the wxFrame.</li>\n<li>Adjust the type of any wxDialog event processing to be wxFrame processing</li>\n</ol>",
        "id": 348724631,
        "sender_full_name": "Tony Voss",
        "timestamp": 1681304732
    }
]